[
  {
    "id": "PLANT001",
    "name": "Ponytail Palm",
    "botanical_name": "Nolina recurvata",
    "image_url": "assets/images/1.png",
    "description": "<strong>Botanical Name:</strong> Nolina recurvata\n<strong>Common Name:</strong> Ponytail Palm\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Eastern Mexico\n<strong>Growth Habit:</strong> Slow-growing, succulent-like tree with a swollen base and long, arching leaves\n<strong>Light Required:</strong> Bright, indirect sunlight\n<strong>Water Required:</strong> Low; allow soil to dry out between waterings\n<strong>Soil Condition:</strong> Well-draining, sandy or cactus mix\n<strong>Uses:</strong> Ornamental indoor/outdoor plant, drought-tolerant landscapes, bonsai",
    "details": "The Ponytail Palm, scientifically called Nolina recurvata, is a slow-growing, succulent-like tree from Eastern Mexico. Its distinctive bulbous base supports long, arching leaves that resemble a flowing ponytail, making it a striking ornamental for homes or gardens. It thrives in bright, indirect sunlight and requires minimal watering, allowing the soil to dry between waterings. A well-draining sandy or cactus mix promotes healthy growth. Low-maintenance and drought-tolerant, it’s perfect for indoor decor, bonsai arrangements, or xeriscaping, bringing elegance and a sculptural touch wherever it’s placed."
  },
  {
    "id": "PLANT002",
    "name": "Blue Cactus",
    "botanical_name": "Pilosocereus sp.",
    "image_url": "assets/images/2.png",
    "description": "<strong>Botanical Name:</strong> Pilosocereus sp.\n<strong>Common Name:</strong> Blue Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Tropical and subtropical regions of the Americas (notably Brazil, the Caribbean, and Mexico)\n<strong>Growth Habit:</strong> Columnar, tree-like cactus with striking bluish-green stems and golden spines\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; water sparingly and allow soil to dry out between waterings\n<strong>Soil Condition:</strong> Well-draining, sandy or cactus mix\n<strong>Uses:</strong> Ornamental plant, xeriscaping, container gardening, desert-themed landscapes",
    "details": "The Blue Cactus, or Pilosocereus sp., is a stunning columnar cactus native to tropical and subtropical regions of the Americas, including Brazil, the Caribbean, and Mexico. Its bluish-green stems are accentuated by golden spines, giving it a striking ornamental presence. This cactus loves full sun and requires minimal watering, with soil allowed to dry completely between watering sessions. Well-draining, sandy soil ensures its healthy growth. Ideal for containers, desert-themed landscapes, or xeriscaping, it’s a resilient, low-maintenance plant that adds vibrant color and vertical interest to any space."
  },
  {
    "id": "PLANT003",
    "name": "Totem Pole Cactus",
    "botanical_name": "Lophocereus schottii",
    "image_url": "assets/images/3.png",
    "description": "<strong>Botanical Name:</strong> Lophocereus schottii\n<strong>Common Name:</strong> Totem Pole Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Sonoran Desert, Northern Mexico and Southern Arizona\n<strong>Growth Habit:</strong> Tall, columnar cactus; often spineless with smooth, bumpy surface (especially in the \"monstrose\" form)\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant, water sparingly\n<strong>Soil Condition:</strong> Well-draining, sandy or cactus mix\n<strong>Uses:</strong> Ornamental plant, xeriscaping, desert gardens, container cultivation",
    "details": "The Totem Pole Cactus, Lophocereus schottii, hails from the Sonoran Desert of Northern Mexico and Southern Arizona. It grows tall and columnar, often spineless, with a unique bumpy surface that’s particularly notable in its ‘monstrose’ forms. Thriving under full sun, it requires minimal water, making it highly drought-tolerant. Sandy, well-draining soil is essential for growth. Perfect for desert gardens, xeriscaping, or container cultivation, this cactus provides a dramatic vertical accent and is a favorite among collectors and desert plant enthusiasts."
  },
  {
    "id": "PLANT004",
    "name": "Buddha Belly Plant, Gout Plant",
    "botanical_name": "Jatropha podagrica",
    "image_url": "assets/images/4.png",
    "description": "<strong>Botanical Name:</strong> Jatropha podagrica\n<strong>Common Name:</strong> Buddha Belly Plant, Gout Plant\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Central America\n<strong>Growth Habit:</strong> Succulent shrub with a swollen caudex and large lobed leaves\n<strong>Light Required:</strong> Bright, indirect light to full sun\n<strong>Water Required:</strong> Moderate; water when soil is dry\n<strong>Soil Condition:</strong> Well-draining soil\n<strong>Uses:</strong> Ornamental indoor/outdoor plant, medicinal uses (with caution, as it’s toxic)",
    "details": "The Buddha Belly Plant, or Jatropha podagrica, is a succulent shrub native to Central America, notable for its swollen caudex and large lobed leaves. It thrives in bright indirect light to full sun and prefers moderate watering when the soil dries out. Well-draining soil ensures its healthy growth. Often used as an ornamental indoor or outdoor plant, it can also have medicinal applications, though caution is needed as it is toxic. Its unique shape and sculptural appearance make it a captivating addition to any garden or indoor collection."
  },
  {
    "id": "PLANT005",
    "name": "Crested Cat Tail Euphorbia",
    "botanical_name": "Euphorbia leucodendron 'Cristata'",
    "image_url": "assets/images/5.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia leucodendron 'Cristata'\n<strong>Common Name:</strong> Crested Cat Tail Euphorbia\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Crested form with sculptural, fan-like growth on cylindrical stems\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining cactus or succulent mix\n<strong>Uses:</strong> Decorative plant for collectors, xeriscaping, container gardens",
    "details": "The Crested Cat Tail Euphorbia, scientifically Euphorbia leucodendron ‘Cristata’, originates from Madagascar. Its fan-like, crested growth on cylindrical stems creates a sculptural, almost architectural appearance. It thrives in bright light to full sun and requires low water, being highly drought-tolerant. A well-draining cactus or succulent mix is ideal for its growth. Popular among collectors, it adds dramatic visual interest to xeriscaping, container gardens, or ornamental displays, standing out as a unique and eye-catching specimen."
  },
  {
    "id": "PLANT006",
    "name": "Crested Euphorbia, Coral Cactus",
    "botanical_name": "Euphorbia lactea 'Crest'",
    "image_url": "assets/images/6.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia lactea 'Crest'\n<strong>Common Name:</strong> Crested Euphorbia, Coral Cactus\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> India (parent species)\n<strong>Growth Habit:</strong> Fan-shaped, crested form often grafted onto a Euphorbia rootstock\n<strong>Light Required:</strong> Bright indirect light to partial sun\n<strong>Water Required:</strong> Low; water sparingly\n<strong>Soil Condition:</strong> Well-draining soil\n<strong>Uses:</strong> Unique ornamental plant, often grown in containers or as a grafted specimen",
    "details": "The Crested Euphorbia, also called Coral Cactus (Euphorbia lactea 'Crest'), originates from India and is usually grafted onto a Euphorbia rootstock. Its fan-shaped, crested growth creates a striking visual impact, with bright, sculptural foliage that enhances any space. Thriving in bright indirect light to partial sun, it requires minimal water and well-draining soil to prevent rot. Ideal for containers or as a grafted specimen, this plant is perfect for collectors or anyone seeking an ornamental cactus with bold, architectural appeal."
  },
  {
    "id": "PLANT008",
    "name": "Golden Barrel Cactus",
    "botanical_name": "Echinocactus grusonii",
    "image_url": "assets/images/8.png",
    "description": "<strong>Botanical Name:</strong> Echinocactus grusonii\n<strong>Common Name:</strong> Golden Barrel Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Round, barrel-shaped cactus with prominent ribs and golden spines\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; water only when soil is dry\n<strong>Soil Condition:</strong> Well-draining, sandy or gritty soil\n<strong>Uses:</strong> Popular in rock gardens, desert landscapes, and containers",
    "details": "The Golden Barrel Cactus, or Echinocactus grusonii, is a round, barrel-shaped cactus native to Mexico. With prominent ribs and striking golden spines, it’s a visual showstopper in any desert garden or container. This cactus thrives in full sun and requires minimal watering, making it exceptionally drought-tolerant. Well-draining, sandy or gritty soil is ideal for its growth. Its symmetrical, globe-like shape and vibrant coloration make it a favorite in rock gardens, xeriscaping, and ornamental collections, providing both texture and color contrast to other succulents."
  },
  {
    "id": "PLANT009",
    "name": "Ball Cactus, Balloon Cactus",
    "botanical_name": "Notocactus magnificus (also known as Parodia magnifica)",
    "image_url": "assets/images/9.png",
    "description": "<strong>Botanical Name:</strong> Notocactus magnificus (also known as Parodia magnifica)\n<strong>Common Name:</strong> Ball Cactus, Balloon Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Southern Brazil, Uruguay\n<strong>Growth Habit:</strong> Globular to short columnar cactus with ribs and yellow spines\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate; allow soil to dry between watering\n<strong>Soil Condition:</strong> Well-draining cactus mix\n<strong>Uses:</strong> Decorative cactus for pots or succulent arrangements",
    "details": "The Ball Cactus, scientifically known as Notocactus magnificus or Parodia magnifica, is a globular cactus from Southern Brazil and Uruguay. It has well-defined ribs and attractive yellow spines, often forming a short columnar shape. Preferring bright light to full sun, it requires moderate watering, allowing the soil to dry in between. A well-draining cactus mix ensures healthy development. Perfect for pots, rock gardens, or succulent arrangements, this ornamental cactus is appreciated for its symmetry, compact size, and vibrant color contrast."
  },
  {
    "id": "PLANT010",
    "name": "Barrel Cactus (varies by species)",
    "botanical_name": "Ferocactus sp.",
    "image_url": "assets/images/10.png",
    "description": "<strong>Botanical Name:</strong> Ferocactus sp.\n<strong>Common Name:</strong> Barrel Cactus (varies by species)\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Southwestern U.S. and Mexico\n<strong>Growth Habit:</strong> Large barrel-shaped cactus with heavy ribs and prominent spines\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Landscape feature in arid gardens, containers, erosion control",
    "details": "The Barrel Cactus, belonging to the genus Ferocactus, is native to the Southwestern USA and Mexico. It grows large and barrel-shaped with heavy ribs and robust spines. This cactus thrives under full sun and requires minimal water, making it highly drought-resistant. Sandy, well-draining soil is necessary for optimal growth. Commonly used as a landscape feature in arid gardens, container cultivation, or for erosion control, its imposing structure and longevity make it a striking addition to any desert-themed landscape or xeriscape."
  },
  {
    "id": "PLANT011",
    "name": "Diadem Prickly Pear",
    "botanical_name": "Opuntia diademata",
    "image_url": "assets/images/11.png",
    "description": "<strong>Botanical Name:</strong> Opuntia diademata\n<strong>Common Name:</strong> Diadem Prickly Pear\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> South America (notably Argentina and surrounding regions)\n<strong>Growth Habit:</strong> Clumping cactus with flattened pads and clusters of spines\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental plant, xeriscaping, erosion control",
    "details": "The Diadem Prickly Pear, Opuntia diademata, is a striking clumping cactus native to South America, particularly Argentina. Its flattened pads are adorned with clusters of spines, creating a sculptural, ornamental form. Thriving under full sun, it requires minimal water and well-draining sandy or rocky soil. This cactus is ideal for xeriscaping, erosion control, and as a statement plant in ornamental gardens. Its low-maintenance nature combined with its unique pad structure makes it perfect for collectors and landscape designers alike, adding texture and interest to arid or desert-inspired settings."
  },
  {
    "id": "PLANT012",
    "name": "Falcate Prickly Pear",
    "botanical_name": "Opuntia falcata",
    "image_url": "assets/images/12.png",
    "description": "<strong>Botanical Name:</strong> Opuntia falcata\n<strong>Common Name:</strong> Falcate Prickly Pear\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> North and Central America (exact range varies by variety)\n<strong>Growth Habit:</strong> Sprawling to upright cactus with falcate (sickle-shaped) pads\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; water when soil is dry\n<strong>Soil Condition:</strong> Well-draining soil\n<strong>Uses:</strong> Ornamental, drought-tolerant landscaping, habitat plant",
    "details": "The Falcate Prickly Pear, Opuntia falcata, is native to North and Central America and features gracefully curved, sickle-shaped pads. This sprawling cactus thrives in full sun with low water requirements, preferring well-draining soil. It is widely used in ornamental and drought-tolerant landscaping, providing a natural habitat for wildlife and pollinators. Its elegant pad formation and resilience make it a valuable addition to xeriscapes, container gardens, or as a natural fencing option, adding both form and function to any dry garden."
  },
  {
    "id": "PLANT013",
    "name": "Cow’s Tongue Prickly Pear",
    "botanical_name": "Opuntia linguiformis",
    "image_url": "assets/images/13.png",
    "description": "<strong>Botanical Name:</strong> Opuntia linguiformis\n<strong>Common Name:</strong> Cow’s Tongue Prickly Pear\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico and Southern USA\n<strong>Growth Habit:</strong> Large, flat pads shaped like a cow's tongue; forms dense clumps\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; very drought-resistant\n<strong>Soil Condition:</strong> Well-draining soil\n<strong>Uses:</strong> Ornamental, livestock fencing, traditional uses in arid farming",
    "details": "The Cow’s Tongue Prickly Pear, Opuntia linguiformis, is native to Mexico and the southern USA. Its large, flat pads resemble a cow’s tongue and form dense clumps, creating a bold statement in gardens. Thriving in full sun and extremely drought-resistant, it requires well-draining soil to flourish. Beyond its ornamental appeal, it has traditional uses in arid farming and serves as natural fencing for livestock. Its striking form, ease of care, and robust nature make it a favorite among cactus enthusiasts and landscape architects."
  },
  {
    "id": "PLANT014",
    "name": "Bunny Ears Cactus",
    "botanical_name": "Opuntia microdasys",
    "image_url": "assets/images/14.png",
    "description": "<strong>Botanical Name:</strong> Opuntia microdasys\n<strong>Common Name:</strong> Bunny Ears Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Clump-forming cactus with pad segments and tiny, fuzzy glochids (no large spines)\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Low; allow to dry between watering\n<strong>Soil Condition:</strong> Well-draining, cactus mix\n<strong>Uses:</strong> Popular indoor succulent, ornamental cactus",
    "details": "The Bunny Ears Cactus, Opuntia microdasys, originates from Mexico and is easily recognized by its clump-forming pads and tiny, fuzzy glochids. Lacking large spines, it is safe for indoor display and thrives in bright light to full sun. Minimal watering and well-draining cactus soil are key to healthy growth. This charming ornamental cactus is popular as a houseplant or in desert-themed gardens, appreciated for its unique silhouette and playful resemblance to rabbit ears, adding both personality and elegance to any collection."
  },
  {
    "id": "PLANT015",
    "name": "Blind Prickly Pear",
    "botanical_name": "Opuntia rufida",
    "image_url": "assets/images/15.png",
    "description": "<strong>Botanical Name:</strong> Opuntia rufida\n<strong>Common Name:</strong> Blind Prickly Pear\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Texas (USA) and Northern Mexico\n<strong>Growth Habit:</strong> Pad-forming cactus with reddish-brown glochids; lacks long spines\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental, xeriscaping, erosion control",
    "details": "Opuntia rufida, commonly known as the Blind Prickly Pear, is a hardy cactus native to Texas and Northern Mexico. Its pad-forming stems feature reddish-brown glochids and lack long spines, creating a soft, visually appealing texture. Preferring full sun and sandy or rocky soil, it is extremely drought-tolerant. Widely used for ornamental landscaping, erosion control, and xeriscaping, the Blind Prickly Pear is admired for its resilience, adaptability, and distinctive coloration, making it a valuable addition to dry gardens and cactus collections."
  },
  {
    "id": "PLANT016",
    "name": "Monstrous Prickly Pear",
    "botanical_name": "Opuntia tuna 'Monstruosa'",
    "image_url": "assets/images/16.png",
    "description": "<strong>Botanical Name:</strong> Opuntia tuna 'Monstruosa'\n<strong>Common Name:</strong> Monstrous Prickly Pear\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Cultivar form (likely based on native Mexican Opuntia species)\n<strong>Growth Habit:</strong> Dwarf, contorted pad formations; irregular and compact\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Low; allow soil to dry out completely\n<strong>Soil Condition:</strong> Well-draining, gritty soil\n<strong>Uses:</strong> Collectors’ plant, ornamental cactus, bonsai-style arrangements",
    "details": "The Monstrous Prickly Pear, Opuntia tuna ‘Monstruosa’, is a dwarf, contorted cactus cultivar likely derived from native Mexican Opuntia species. Its irregular, compact pad formations create a fascinating, sculptural appearance. This cactus thrives in bright light to full sun and requires low water with well-draining, gritty soil. Highly prized by collectors, it is ideal for bonsai-style arrangements or ornamental cactus collections. Its unusual form, durability, and low-maintenance nature make it a standout specimen in any desert-themed or indoor cactus display."
  },
  {
    "id": "PLANT017",
    "name": "Violet Acanthocalycium",
    "botanical_name": "Acanthocalycium violaceum",
    "image_url": "assets/images/17.png",
    "description": "<strong>Botanical Name:</strong> Acanthocalycium violaceum\n<strong>Common Name:</strong> Violet Acanthocalycium\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Argentina\n<strong>Growth Habit:</strong> Globular cactus with ribs and prominent spines, violet to purple flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy soil\n<strong>Uses:</strong> Ornamental, container gardening",
    "details": "Acanthocalycium violaceum, or Violet Acanthocalycium, is a globular cactus native to Argentina. With well-defined ribs, prominent spines, and striking violet to purple flowers, it is a visual delight. This ornamental cactus thrives in full sun to partial shade and requires minimal watering with sandy, well-draining soil. Perfect for container gardening or desert-inspired landscapes, it offers both vibrant color and textural contrast. Its flowering nature, compact size, and easy care make it an essential choice for collectors and home enthusiasts seeking a splash of desert color."
  },
  {
    "id": "PLANT018",
    "name": "Peanut Cactus (Hybrid)",
    "botanical_name": "Chamaecereus silvestrii (Hybrid)",
    "image_url": "assets/images/18.png",
    "description": "<strong>Botanical Name:</strong> Chamaecereus silvestrii (Hybrid)\n<strong>Common Name:</strong> Peanut Cactus (Hybrid)\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Argentina (hybrid varieties cultivated worldwide)\n<strong>Growth Habit:</strong> Low-growing, clustering cactus with finger-like stems; produces orange to red flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; water sparingly\n<strong>Soil Condition:</strong> Well-draining cactus mix\n<strong>Uses:</strong> Ornamental, hanging baskets, rock gardens",
    "details": "The Peanut Cactus, Chamaecereus silvestrii hybrid, is a low-growing, clustering cactus originating from Argentina. Its finger-like stems produce vivid orange to red flowers, adding seasonal interest. It prefers full sun to partial shade and requires minimal water in well-draining cactus soil. Popular in rock gardens, hanging baskets, and ornamental collections, the Peanut Cactus hybrid combines charm and resilience. Its ability to form dense clusters and vibrant floral displays makes it a standout addition to succulent and cactus enthusiasts’ collections."
  },
  {
    "id": "PLANT019",
    "name": "Dwarf Copiapoa",
    "botanical_name": "Copiapoa humilis",
    "image_url": "assets/images/19.png",
    "description": "<strong>Botanical Name:</strong> Copiapoa humilis\n<strong>Common Name:</strong> Dwarf Copiapoa\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Northern Chile (Atacama Desert)\n<strong>Growth Habit:</strong> Small globular cactus forming clusters; gray-green body with woolly crown\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Very low; highly drought-tolerant\n<strong>Soil Condition:</strong> Sandy, rocky, well-drained soil\n<strong>Uses:</strong> Xeriscaping, rock gardens, collectors’ specimen",
    "details": "Copiapoa humilis, or Dwarf Copiapoa, is a small globular cactus from the Atacama Desert in northern Chile. Forming compact clusters with a gray-green body and woolly crown, it produces minimal flowers yet offers sculptural appeal. Thriving in full sun with very low water requirements, it prefers sandy, rocky, well-draining soil. Ideal for xeriscaping, rock gardens, or collectors’ specimens, this cactus stands out for its resilience, compact size, and unique desert adaptation, making it a fascinating addition to any ornamental cactus collection."
  },
  {
    "id": "PLANT020",
    "name": "Mountain Copiapoa",
    "botanical_name": "Copiapoa montana",
    "image_url": "assets/images/20.png",
    "description": "<strong>Botanical Name:</strong> Copiapoa montana\n<strong>Common Name:</strong> Mountain Copiapoa\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Chile (coastal desert regions)\n<strong>Growth Habit:</strong> Solitary to clustering spherical cactus; dark green to brownish stems with black spines\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Very low; drought-resistant\n<strong>Soil Condition:</strong> Sandy-gravel soil with excellent drainage\n<strong>Uses:</strong> Ornamental, xeriscaping, rare cactus collections",
    "details": "Copiapoa montana, known as Mountain Copiapoa, is a rare cactus native to Chile’s coastal desert regions. Solitary or clustering, its spherical dark green to brownish stems are adorned with black spines, producing a striking landscape feature. Thriving in full sun and very low water, it requires sandy-gravel soil with excellent drainage. Its rarity and ornamental value make it highly sought after by collectors. Perfect for xeriscaping or desert-inspired gardens, Mountain Copiapoa combines elegance, durability, and a touch of exclusivity for cactus enthusiasts."
  },
  {
    "id": "PLANT021",
    "name": "Finger Cactus",
    "botanical_name": "Dolichothele longimamma",
    "image_url": "assets/images/21.png",
    "description": "<strong>Botanical Name:</strong> Dolichothele longimamma\n<strong>Common Name:</strong> Finger Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Cluster-forming cactus with long finger-like tubercles; yellow flowers\n<strong>Light Required:</strong> Full sun to light shade\n<strong>Water Required:</strong> Low; drought-tolerant but benefits from occasional watering in growing season\n<strong>Soil Condition:</strong> Porous, sandy, well-draining soil\n<strong>Uses:</strong> Ornamental, container plant, collectors’ favorite",
    "details": "The Finger Cactus, Dolichothele longimamma, originates from Mexico and is known for its long, finger-like tubercles forming dense clusters. Yellow flowers bloom during its growing season, adding vibrant contrast. Thriving in full sun to light shade, it requires low water but benefits from occasional hydration in growth periods. Porous, sandy, well-draining soil ensures healthy development. A collector’s favorite, this ornamental cactus is ideal for container display, rock gardens, or desert-inspired landscaping, offering both visual interest and easy maintenance."
  },
  {
    "id": "PLANT022",
    "name": "Purple Candle Cactus",
    "botanical_name": "Echinocereus purpureus",
    "image_url": "assets/images/22.png",
    "description": "<strong>Botanical Name:</strong> Echinocereus purpureus\n<strong>Common Name:</strong> Purple Candle Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Southwestern USA and Northern Mexico\n<strong>Growth Habit:</strong> Columnar cactus with clustering stems; produces large purple-magenta flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Rocky, well-draining soil\n<strong>Uses:</strong> Ornamental, xeriscaping, pollinator gardens",
    "details": "Echinocereus purpureus, the Purple Candle Cactus, hails from Southwestern USA and Northern Mexico. Its columnar stems cluster together, producing striking large purple-magenta flowers. Thriving in full sun and rocky, well-draining soil, it is extremely drought-tolerant. This ornamental cactus enhances xeriscaping, pollinator gardens, and container arrangements. Its upright stature, bold color, and resilience make it an attractive choice for gardeners and collectors seeking low-maintenance yet visually compelling desert plants."
  },
  {
    "id": "PLANT023",
    "name": "Easter Lily Cactus Hybrid",
    "botanical_name": "Echinopsis (Hybrid)",
    "image_url": "assets/images/23.png",
    "description": "<strong>Botanical Name:</strong> Echinopsis (Hybrid)\n<strong>Common Name:</strong> Easter Lily Cactus Hybrid\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> South America (hybrid forms cultivated worldwide)\n<strong>Growth Habit:</strong> Globular cactus with ribs and spines; produces large, colorful, trumpet-shaped flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Moderate to low; allow soil to dry between watering\n<strong>Soil Condition:</strong> Well-draining cactus mix\n<strong>Uses:</strong> Ornamental, flowering collections",
    "details": "The Easter Lily Cactus Hybrid, Echinopsis hybrid, is a globular cactus native to South America with cultivated hybrid forms worldwide. Its ribbed stems adorned with spines produce large, trumpet-shaped, colorful flowers, making it a spectacular display during blooming seasons. Preferring full sun to partial shade and well-draining cactus mix, it requires moderate to low watering. Ideal for ornamental collections, flowering cactus enthusiasts, and container gardening, this cactus combines elegance, bold floral displays, and ease of care for both collectors and home gardeners."
  },
  {
    "id": "PLANT024",
    "name": "Christmas Cactus",
    "botanical_name": "Zygocactus truncatus",
    "image_url": "assets/images/24.png",
    "description": "<strong>Botanical Name:</strong> Zygocactus truncatus\n<strong>Common Name:</strong> Christmas Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Brazil (rainforest habitats)\n<strong>Growth Habit:</strong> Epiphytic cactus with flat segmented stems; brightly colored flowers (pink, red, white)\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Moderate; water when soil begins to dry\n<strong>Soil Condition:</strong> Well-draining, organic-rich soil\n<strong>Uses:</strong> Ornamental houseplant, seasonal decoration",
    "details": "Zygocactus truncatus, the Christmas Cactus, is an epiphytic cactus from Brazil’s rainforest. Its flat segmented stems bloom with brightly colored flowers in pink, red, or white. Thriving in bright indirect light, it requires moderate watering and well-draining, organic-rich soil. Perfect for indoor ornamental purposes and seasonal decoration, it is widely appreciated for its winter blooms. This low-maintenance cactus brings festive cheer, adds vibrant color to interiors, and enhances plant collections with its unique tropical origin and elegant flowering pattern."
  },
  {
    "id": "PLANT025",
    "name": "Holiday Cactus (true Christmas Cactus)",
    "botanical_name": "Schlumbergera bridgesii",
    "image_url": "assets/images/25.png",
    "description": "<strong>Botanical Name:</strong> Schlumbergera bridgesii\n<strong>Common Name:</strong> Holiday Cactus (true Christmas Cactus)\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Brazil (cloud forests)\n<strong>Growth Habit:</strong> Epiphytic cactus with arching segmented stems; blooms in winter with tubular flowers\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Moderate; requires more moisture than desert cacti\n<strong>Soil Condition:</strong> Well-draining, humus-rich mix\n<strong>Uses:</strong> Indoor ornamental, holiday decoration",
    "details": "Schlumbergera bridgesii, or the true Holiday Cactus, is native to Brazil’s cloud forests. Its arching, segmented stems bloom with tubular flowers during winter, often in bright red or pink. Preferring bright indirect light and humus-rich, well-draining soil, it requires moderate moisture. Widely used as an indoor ornamental and holiday decoration, it adds seasonal color and elegance to homes. Its epiphytic nature, winter blooms, and low-maintenance care make it a favorite among indoor plant enthusiasts."
  },
  {
    "id": "PLANT026",
    "name": "Prolific Pincushion Cactus",
    "botanical_name": "Mammillaria prolifera",
    "image_url": "assets/images/26.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria prolifera\n<strong>Common Name:</strong> Prolific Pincushion Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico, Central America, Caribbean\n<strong>Growth Habit:</strong> Small, clustering cactus with many offsets; yellowish-white spines; produces small cream-colored flowers and red fruits\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Ornamental, container plant, xeriscaping",
    "details": "The Prolific Pincushion Cactus, Mammillaria prolifera, hails from Mexico, Central America, and the Caribbean. Small and clustering, it produces many offsets with yellowish-white spines, cream-colored flowers, and red fruits. Thriving in full sun to partial shade with sandy, well-draining soil, it requires minimal water. Ideal for container gardens, xeriscaping, and ornamental collections, its compact clusters and consistent flowering make it a favorite for collectors seeking a resilient yet visually appealing cactus."
  },
  {
    "id": "PLANT027",
    "name": "Thimble Cactus",
    "botanical_name": "Mammillaria gracilis",
    "image_url": "assets/images/27.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria gracilis\n<strong>Common Name:</strong> Thimble Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Small clustering cactus with cylindrical stems covered in white spines; produces small white to yellowish flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Porous, sandy, well-draining soil\n<strong>Uses:</strong> Ornamental, rock gardens, container collections",
    "details": "Mammillaria gracilis, the Thimble Cactus, is a small, clustering cactus native to Mexico. Cylindrical stems covered in white spines produce small white to yellowish flowers, adding subtle charm. Preferring full sun to partial shade and porous, sandy soil, it requires minimal water. Its ornamental value shines in rock gardens, container collections, and succulent arrangements. Known for its compact size, low maintenance, and delicate flowering, this cactus is a perfect addition to both beginner and advanced cactus collections."
  },
  {
    "id": "PLANT028",
    "name": "Pringle’s Pincushion Cactus",
    "botanical_name": "Mammillaria pringlei",
    "image_url": "assets/images/28.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria pringlei\n<strong>Common Name:</strong> Pringle’s Pincushion Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Solitary or clustering small cactus; cylindrical to globular stems with radial spines; produces pinkish to purple flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, rocky, well-draining soil\n<strong>Uses:</strong> Ornamental, collectors’ cactus",
    "details": "Mammillaria pringlei, commonly known as Pringle’s Pincushion Cactus, is a small cactus native to Mexico. Its cylindrical to globular stems form solitary or clustering arrangements with radial spines, producing delicate pink to purple flowers. Thriving in full sun and sandy, rocky, well-draining soil, it requires minimal water. This ornamental cactus is perfect for collectors and container gardens. Its subtle flowering, compact form, and low-maintenance care make it an elegant addition to any desert-inspired landscape or cactus collection."
  },
  {
    "id": "PLANT029",
    "name": "Sempervivum Cactus",
    "botanical_name": "Mammillaria sempervivi",
    "image_url": "assets/images/29.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria sempervivi\n<strong>Common Name:</strong> Sempervivum Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Small, globular cactus with dense radial spines; produces pale pink flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; allow soil to dry completely between waterings\n<strong>Soil Condition:</strong> Well-draining, sandy-gravel soil\n<strong>Uses:</strong> Ornamental, cactus collections",
    "details": "The Sempervivum Cactus, Mammillaria sempervivi, is a globular cactus from Mexico, covered in dense radial spines with pale pink flowers during the blooming season. Preferring full sun and sandy-gravel soil, it requires very low water. Ideal for xeriscaping, rock gardens, and ornamental cactus collections, its small size and resilience make it a favorite among enthusiasts. Its consistent flowering, sculptural form, and drought-tolerant nature ensure it stands out in any garden or container display."
  },
  {
    "id": "PLANT030",
    "name": "Backberg’s Pincushion Cactus",
    "botanical_name": "Mammillaria backbergiana",
    "image_url": "assets/images/30.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria backbergiana\n<strong>Common Name:</strong> Backberg’s Pincushion Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Cylindrical cactus forming clumps with woolly areoles; produces small pink to red flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining cactus soil\n<strong>Uses:</strong> Ornamental, collectors’ cactus",
    "details": "Mammillaria backbergiana, or Backberg’s Pincushion Cactus, is a cylindrical cactus native to Mexico that forms clumps with woolly areoles. Small pink to red flowers bloom seasonally, adding vibrant color. Thriving in full sun and well-draining soil, it requires minimal watering. This ornamental cactus is a favorite for collectors due to its compact clusters, striking flowering, and easy maintenance, making it ideal for container arrangements or desert-themed gardens."
  },
  {
    "id": "PLANT031",
    "name": "Mother of Hundreds",
    "botanical_name": "Mammillaria compressa",
    "image_url": "assets/images/31.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria compressa\n<strong>Common Name:</strong> Mother of Hundreds\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Low-growing, clustering cactus with cylindrical stems; produces pink to purple flowers in rings\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; water sparingly\n<strong>Soil Condition:</strong> Sandy, rocky, well-draining soil\n<strong>Uses:</strong> Ornamental, xeriscaping, rock gardens",
    "details": "The Mother of Hundreds, Mammillaria compressa, is a low-growing, clustering cactus from Mexico. Its cylindrical stems produce beautiful pink to purple flowers arranged in circular patterns. Thriving in full sun to partial shade with sandy, rocky soil, it requires minimal water. Perfect for xeriscaping, rock gardens, and ornamental collections, this cactus is prized for its floral display, resilience, and compact growth habit, providing both color and texture to desert-inspired landscapes."
  },
  {
    "id": "PLANT032",
    "name": "Powder Puff Cactus",
    "botanical_name": "Mammillaria bocasana",
    "image_url": "assets/images/32.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria bocasana\n<strong>Common Name:</strong> Powder Puff Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Small, clustering cactus covered in soft white hair-like spines; produces pink flowers and red fruits\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Porous, well-draining soil\n<strong>Uses:</strong> Ornamental, container cactus",
    "details": "Mammillaria bocasana, known as the Powder Puff Cactus, is a small, clustering cactus native to Mexico. Its soft, white, hair-like spines cover the plant, which produces pink flowers and red fruits. Thriving in full sun to partial shade and well-draining soil, it requires minimal watering. Ideal for container gardening, ornamental collections, and xeriscaping, it combines softness with vibrant floral accents, creating a visually pleasing and low-maintenance addition to any cactus collection."
  },
  {
    "id": "PLANT033",
    "name": "Nunez’s Pincushion Cactus",
    "botanical_name": "Mammillaria nunezi",
    "image_url": "assets/images/33.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria nunezi\n<strong>Common Name:</strong> Nunez’s Pincushion Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Small globular cactus, forms clusters; radial spines with central hooked spines; produces pink flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; water sparingly\n<strong>Soil Condition:</strong> Sandy, rocky, well-draining soil\n<strong>Uses:</strong> Ornamental, cactus collections",
    "details": "Mammillaria nunezi, or Nunez’s Pincushion Cactus, is a small, globular cactus from Mexico that forms clusters. Its radial spines and central hooked spines produce pink flowers seasonally. Thriving in full sun and sandy, rocky soil, it requires low water. Perfect for collectors and ornamental cactus displays, this cactus is valued for its compact growth, striking flowering, and resilience, making it ideal for desert-inspired gardens and container arrangements."
  },
  {
    "id": "PLANT034",
    "name": "Cushion Rebutia",
    "botanical_name": "Rebutia pulvinosa",
    "image_url": "assets/images/34.png",
    "description": "<strong>Botanical Name:</strong> Rebutia pulvinosa\n<strong>Common Name:</strong> Cushion Rebutia\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Bolivia, Argentina\n<strong>Growth Habit:</strong> Small globular cactus forming clusters; produces brilliant orange to red funnel-shaped flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy soil\n<strong>Uses:</strong> Ornamental, container gardening, collectors’ cactus",
    "details": "The Cushion Rebutia, Rebutia pulvinosa, is a globular cactus forming tight clusters, native to Bolivia and Argentina. It produces brilliant orange to red funnel-shaped flowers, making it visually striking. Thriving in full sun to partial shade and sandy, well-draining soil, it requires minimal water. Perfect for container gardening, collectors’ cactus arrangements, and ornamental xeriscapes, its vibrant blooms and compact structure make it a standout for both enthusiasts and home displays."
  },
  {
    "id": "PLANT035",
    "name": "Giant Chin Cactus",
    "botanical_name": "Gymnocalycium saglionis",
    "image_url": "assets/images/35.png",
    "description": "<strong>Botanical Name:</strong> Gymnocalycium saglionis\n<strong>Common Name:</strong> Giant Chin Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Argentina\n<strong>Growth Habit:</strong> Large globular cactus with ribs and long curved spines; produces pale pinkish-white flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy-gravel soil, well-draining\n<strong>Uses:</strong> Ornamental, collectors’ specimen",
    "details": "Gymnocalycium saglionis, the Giant Chin Cactus, is a large globular cactus from Argentina with well-defined ribs and long curved spines. Pale pinkish-white flowers bloom during the season, providing contrast against its robust form. Thriving in full sun and sandy-gravel soil, it is drought-tolerant. Ideal for collectors, ornamental gardens, and xeriscapes, its impressive size, flowering, and resilience make it a centerpiece cactus that draws attention and admiration."
  },
  {
    "id": "PLANT036",
    "name": "Dwarf Chin Cactus",
    "botanical_name": "Gymnocalycium baldianum",
    "image_url": "assets/images/36.png",
    "description": "<strong>Botanical Name:</strong> Gymnocalycium baldianum\n<strong>Common Name:</strong> Dwarf Chin Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Argentina\n<strong>Growth Habit:</strong> Small globular cactus with ribs and small spines; produces vibrant red, pink, or purple flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining cactus mix\n<strong>Uses:</strong> Ornamental, flowering cactus collections",
    "details": "The Dwarf Chin Cactus, Gymnocalycium baldianum, hails from Argentina. Small and globular with defined ribs and short spines, it produces vibrant red, pink, or purple flowers. Preferring full sun to partial shade and well-draining soil, it requires low water. This ornamental cactus is perfect for flowering collections, container gardens, and desert-themed arrangements, offering brilliant color and compact elegance in a low-maintenance format."
  },
  {
    "id": "PLANT037",
    "name": "Various Pincushion Cactus",
    "botanical_name": "Mammillaria var.",
    "image_url": "assets/images/37.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria var.\n<strong>Common Name:</strong> Various Pincushion Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico, Southwestern USA, Central America\n<strong>Growth Habit:</strong> Small globular to cylindrical cacti with spines; produce small colorful flowers depending on the variety\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, porous, well-draining soil\n<strong>Uses:</strong> Ornamental, cactus collections, xeriscaping",
    "details": "Mammillaria var., the Various Pincushion Cactus, includes small globular to cylindrical cacti native to Mexico, Southwestern USA, and Central America. Their spines and small, colorful flowers vary by species. Thriving in full sun to partial shade with sandy, porous soil, they are drought-tolerant. Perfect for ornamental collections, xeriscaping, and container arrangements, these cacti offer diversity, resilience, and beauty for collectors and home gardeners."
  },
  {
    "id": "PLANT038",
    "name": "Ball Cactus",
    "botanical_name": "Notocactus sp.",
    "image_url": "assets/images/38.png",
    "description": "<strong>Botanical Name:</strong> Notocactus sp.\n<strong>Common Name:</strong> Ball Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> South America (Brazil, Uruguay, Argentina)\n<strong>Growth Habit:</strong> Small globular cactus with ribs and spines; produces yellow flowers in spring\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining sandy-gravel soil\n<strong>Uses:</strong> Ornamental, container plant",
    "details": "The Ball Cactus, Notocactus sp., is a globular cactus from South America, including Brazil, Uruguay, and Argentina. Small with well-defined ribs and spines, it produces yellow flowers in spring. Thriving in full sun to partial shade and sandy-gravel soil, it requires low water. This ornamental cactus is ideal for container planting, desert gardens, and cactus collections, offering compact beauty, seasonal blooms, and minimal maintenance."
  },
  {
    "id": "PLANT039",
    "name": "Various Pincushion Cactus",
    "botanical_name": "Mammillaria var.",
    "image_url": "assets/images/39.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria var.\n<strong>Common Name:</strong> Various Pincushion Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico, Southwestern USA, Central America\n<strong>Growth Habit:</strong> Small globular to cylindrical cacti with spines; produce small colorful flowers depending on the variety\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, porous, well-draining soil\n<strong>Uses:</strong> Ornamental, cactus collections, xeriscaping",
    "details": "Another variety of Mammillaria var. includes globular to cylindrical cacti from Mexico, Southwestern USA, and Central America. Small, colorful flowers bloom seasonally from spiny clusters. Thriving in full sun to partial shade and sandy, well-draining soil, they are drought-tolerant. Excellent for ornamental gardens, xeriscaping, and collector displays, these versatile cacti bring texture, charm, and easy care to any desert-themed arrangement."
  },
  {
    "id": "PLANT040",
    "name": "Orange Moon Cactus",
    "botanical_name": "Gymnocalycium mihanovichii ‘Friedrichii Orange’",
    "image_url": "assets/images/40.png",
    "description": "<strong>Botanical Name:</strong> Gymnocalycium mihanovichii ‘Friedrichii Orange’\n<strong>Common Name:</strong> Orange Moon Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Paraguay, cultivated worldwide as grafted forms\n<strong>Growth Habit:</strong> Small globular cactus, often grafted on rootstock; bright orange color due to lack of chlorophyll\n<strong>Light Required:</strong> Bright indirect light (avoid harsh direct sun)\n<strong>Water Required:</strong> Moderate; allow soil to dry before watering\n<strong>Soil Condition:</strong> Well-draining cactus mix\n<strong>Uses:</strong> Ornamental, indoor plant, colorful displays",
    "details": "Gymnocalycium mihanovichii ‘Friedrichii Orange’, the Orange Moon Cactus, originates from Paraguay and is grown worldwide as grafted forms. Its small globular stems, bright orange due to lack of chlorophyll, are grafted on green cactus rootstock. Thriving in bright indirect light and well-draining soil, it requires moderate watering. Perfect for indoor displays, ornamental arrangements, and colorful collections, its vibrant hue, compact size, and unique grafted nature make it highly appealing to collectors and home decorators alike."
  },





























  {
    "id": "PLANT041",
    "name": "Yellow Moon Cactus",
    "botanical_name": "Gymnocalycium mihanovichii ‘Friedrichii Yellow’",
    "image_url": "assets/images/41.png",
    "description": "<strong>Botanical Name:</strong> Gymnocalycium mihanovichii ‘Friedrichii Yellow’\n<strong>Common Name:</strong> Yellow Moon Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Paraguay, cultivated worldwide as grafted forms\n<strong>Growth Habit:</strong> Small globular cactus, grafted onto green cactus stock; vivid yellow coloration\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Moderate; water sparingly\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Ornamental, houseplant, decorative grafted cactus",
    "details": "The Yellow Moon Cactus, Gymnocalycium mihanovichii ‘Friedrichii Yellow’, is a visually striking cactus originating from Paraguay. Grafted onto green cactus stock, its vivid yellow stems lack chlorophyll and rely on the rootstock for survival. It thrives in bright indirect light with moderate, careful watering and sandy, well-draining soil. Perfect for ornamental houseplant use and decorative grafted cactus collections."
  },
  {
    "id": "PLANT042",
    "name": "Pink Moon Cactus",
    "botanical_name": "Gymnocalycium mihanovichii ‘Friedrichii Pink’",
    "image_url": "assets/images/42.png",
    "description": "<strong>Botanical Name:</strong> Gymnocalycium mihanovichii ‘Friedrichii Pink’\n<strong>Common Name:</strong> Pink Moon Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Paraguay, cultivated worldwide as grafted forms\n<strong>Growth Habit:</strong> Small colorful cactus, usually grafted; pink stems with no chlorophyll; requires rootstock to survive\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Moderate; water when soil begins to dry\n<strong>Soil Condition:</strong> Well-draining cactus mix\n<strong>Uses:</strong> Ornamental, decorative indoor cactus",
    "details": "The Pink Moon Cactus, Gymnocalycium mihanovichii ‘Friedrichii Pink’, is a colorful cactus from Paraguay, widely cultivated as grafted forms. Its vibrant pink stems lack chlorophyll and depend on a green rootstock to survive. Requiring bright indirect light, moderate watering, and well-draining cactus mix, it is ideal for ornamental indoor displays and decorative collections."
  },
  {
    "id": "PLANT043",
    "name": "Red Moon Cactus",
    "botanical_name": "Gymnocalycium mihanovichii ‘Friedrichii Red’",
    "image_url": "assets/images/43.png",
    "description": "<strong>Botanical Name:</strong> Gymnocalycium mihanovichii ‘Friedrichii Red’\n<strong>Common Name:</strong> Red Moon Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Paraguay, cultivated worldwide as grafted forms\n<strong>Growth Habit:</strong> Small globular cactus with bright red stems; lacks chlorophyll, typically grafted on hardy rootstock\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Moderate; drought-tolerant when grafted properly\n<strong>Soil Condition:</strong> Well-draining, sandy soil\n<strong>Uses:</strong> Ornamental, houseplant, colorful cactus collections",
    "details": "The Red Moon Cactus, Gymnocalycium mihanovichii ‘Friedrichii Red’, originates from Paraguay and is widely cultivated as a grafted ornamental. Its bright red stems lack chlorophyll and require a hardy rootstock to thrive. Best grown in bright indirect light with well-draining sandy soil, it tolerates moderate watering and adds vibrant color to houseplant collections and decorative cactus displays."
  },
  {
    "id": "PLANT044",
    "name": "Variegated Moon Cactus",
    "botanical_name": "Gymnocalycium mihanovichii ‘Friedrichii Variegated’",
    "image_url": "assets/images/44.png",
    "description": "<strong>Botanical Name:</strong> Gymnocalycium mihanovichii ‘Friedrichii Variegated’\n<strong>Common Name:</strong> Variegated Moon Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Paraguay, cultivated worldwide as grafted forms\n<strong>Growth Habit:</strong> Small cactus with variegated stem colors (yellow, red, pink, orange, and green); generally grafted\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Moderate; avoid overwatering\n<strong>Soil Condition:</strong> Well-draining cactus mix\n<strong>Uses:</strong> Ornamental, collector’s plant, decorative displays",
    "details": "The Variegated Moon Cactus, Gymnocalycium mihanovichii ‘Friedrichii Variegated’, features a variety of colorful stem patterns including yellow, red, pink, orange, and green. Grafted onto a green rootstock, this cactus requires bright indirect light, moderate watering, and well-draining cactus mix. Its striking appearance makes it a favorite for ornamental use, collectors, and decorative indoor displays."
  },
  {
    "id": "PLANT045",
    "name": "Century Plant",
    "botanical_name": "Agave americana",
    "image_url": "assets/images/45.png",
    "description": "<strong>Botanical Name:</strong> Agave americana\n<strong>Common Name:</strong> Century Plant\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Mexico and Southwestern USA\n<strong>Growth Habit:</strong> Large rosette-forming succulent with thick gray-green leaves and sharp spines; monocarpic (flowers once after many years)\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental landscaping, xeriscaping, erosion control, traditional uses in fiber and beverage production",
    "details": "The Century Plant, Agave americana, is a striking succulent native to Mexico and the Southwestern USA. It forms large rosettes with thick gray-green leaves armed with sharp spines. Monocarpic in nature, it flowers once after many years. Thriving in full sun with well-draining sandy or rocky soil, it is drought-tolerant and valued for ornamental landscaping, xeriscaping, erosion control, and traditional uses such as fiber and beverage production."
  },
  {
    "id": "PLANT046",
    "name": "Variegated Century Plant (Mediopicta)",
    "botanical_name": "Agave americana ‘Mediopicta’",
    "image_url": "assets/images/46.png",
    "description": "<strong>Botanical Name:</strong> Agave americana ‘Mediopicta’\n<strong>Common Name:</strong> Variegated Century Plant (Mediopicta)\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Mexico (cultivar)\n<strong>Growth Habit:</strong> Large rosette succulent with striking variegated leaves (green margins and creamy-yellow central stripe)\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy soil\n<strong>Uses:</strong> Ornamental focal plant, xeriscaping, container gardening",
    "details": "Agave americana ‘Mediopicta’, known as the Variegated Century Plant, is a visually stunning succulent from Mexico. Its large rosette displays green-edged leaves with a creamy-yellow central stripe. This plant thrives in full sun, low-water conditions, and well-draining sandy soil, making it ideal for ornamental focal points, xeriscaping, and container gardening."
  },
  {
    "id": "PLANT047",
    "name": "Narrow-leaf Century Plant",
    "botanical_name": "Agave angustifolia",
    "image_url": "assets/images/47.png",
    "description": "<strong>Botanical Name:</strong> Agave angustifolia\n<strong>Common Name:</strong> Narrow-leaf Century Plant\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Mexico, Central America\n<strong>Growth Habit:</strong> Medium-sized rosette succulent with narrow, sword-shaped leaves; forms dense clusters; monocarpic\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy or rocky, well-draining soil\n<strong>Uses:</strong> Ornamental, xeriscaping, tequila production (closely related species)",
    "details": "Agave angustifolia, or Narrow-leaf Century Plant, is a medium-sized rosette succulent from Mexico and Central America. Featuring narrow, sword-shaped leaves that form dense clusters, it is monocarpic, flowering once in its lifetime. Thriving in full sun and well-draining sandy or rocky soil, this drought-tolerant plant is used for ornamental landscaping, xeriscaping, and in closely related species, tequila production."
  },
  {
    "id": "PLANT048",
    "name": "Thorncrest Century Plant / Dwarf Century Plant",
    "botanical_name": "Agave univittata",
    "image_url": "assets/images/48.png",
    "description": "<strong>Botanical Name:</strong> Agave univittata\n<strong>Common Name:</strong> Thorncrest Century Plant / Dwarf Century Plant\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Mexico, Texas (USA)\n<strong>Growth Habit:</strong> Small rosette succulent with stiff, narrow green leaves often marked with a central stripe; offsets readily\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining sandy or gravelly soil\n<strong>Uses:</strong> Ornamental, small-scale xeriscaping, container plant",
    "details": "Agave univittata, commonly called Thorncrest or Dwarf Century Plant, is a compact rosette-forming succulent native to Mexico and Texas. Its stiff, narrow green leaves often feature a central stripe and produce offsets readily. Suited for full sun, low-water conditions, and well-draining sandy or gravelly soil, it is ideal for ornamental use, small-scale xeriscaping, and container cultivation."
  },
  {
    "id": "PLANT049",
    "name": "Small Flower Agave",
    "botanical_name": "Agave parviflora",
    "image_url": "assets/images/49.png",
    "description": "<strong>Botanical Name:</strong> Agave parviflora\n<strong>Common Name:</strong> Small Flower Agave\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Arizona (USA), Mexico\n<strong>Growth Habit:</strong> Small compact rosette with narrow leaves edged in white filaments; produces tall flower spike after many years\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, rocky, well-drained soil\n<strong>Uses:</strong> Ornamental, rock gardens, xeriscaping",
    "details": "Agave parviflora, or Small Flower Agave, is a compact rosette succulent from Arizona and Mexico. Its narrow leaves feature delicate white filaments, and it produces a tall flowering spike after many years. Thriving in full sun with low-water and well-draining sandy or rocky soil, it is perfect for ornamental use, rock gardens, and xeriscaping."
  },
  {
    "id": "PLANT050",
    "name": "Mitis Agave / Elegant Agave",
    "botanical_name": "Agave mitis",
    "image_url": "assets/images/50.png",
    "description": "<strong>Botanical Name:</strong> Agave mitis\n<strong>Common Name:</strong> Mitis Agave / Elegant Agave\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Medium rosette-forming succulent with broad blue-green leaves; softer spines compared to other agaves\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining sandy or rocky soil\n<strong>Uses:</strong> Ornamental landscaping, container plant, xeriscaping",
    "details": "Agave mitis, known as Mitis or Elegant Agave, is a medium-sized rosette succulent native to Mexico. It features broad blue-green leaves with softer spines than many agaves. Adapted to full sun or partial shade, low-water conditions, and well-draining sandy or rocky soil, this plant is ideal for ornamental landscaping, container gardening, and xeriscaping."
  },
  {
    "id": "PLANT051",
    "name": "Variegated Butterfly Agave",
    "botanical_name": "Agave potatorum variegata",
    "image_url": "assets/images/51.png",
    "description": "<strong>Botanical Name:</strong> Agave potatorum variegata\n<strong>Common Name:</strong> Variegated Butterfly Agave\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Rosette-forming succulent, compact, slow-growing\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental plant for rock gardens, xeriscaping, and containers",
    "details": "Agave potatorum variegata, known as the Variegated Butterfly Agave, is a compact, rosette-forming succulent native to Mexico. Its slow-growing nature and variegated foliage make it an attractive addition to rock gardens, xeriscaping projects, and container plantings. Thriving in full sun to partial shade with well-draining sandy or rocky soil, it requires minimal watering and is highly drought-tolerant."
  },
  {
    "id": "PLANT052",
    "name": "Smooth Agave / Dwarf Smooth Agave",
    "botanical_name": "Agave desmetiana",
    "image_url": "assets/images/52.png",
    "description": "<strong>Botanical Name:</strong> Agave desmetiana\n<strong>Common Name:</strong> Smooth Agave / Dwarf Smooth Agave\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Mexico (cultivated worldwide)\n<strong>Growth Habit:</strong> Medium-sized rosette, smooth-edged leaves, offsets readily\n<strong>Light Required:</strong> Full sun to light shade\n<strong>Water Required:</strong> Low; occasional watering\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Ornamental, landscaping, drought-tolerant gardens",
    "details": "Agave desmetiana, commonly called Smooth Agave or Dwarf Smooth Agave, is a medium-sized rosette succulent native to Mexico. Its smooth-edged leaves and offsetting habit make it ideal for ornamental use in gardens and landscapes. Adapted to full sun or light shade, it thrives in sandy, well-draining soil and requires low maintenance with occasional watering."
  },
  {
    "id": "PLANT053",
    "name": "Thick-Spined Agave",
    "botanical_name": "Agave pachycentra",
    "image_url": "assets/images/53.png",
    "description": "<strong>Botanical Name:</strong> Agave pachycentra\n<strong>Common Name:</strong> Thick-Spined Agave\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Medium-sized rosette, thick leaves with marginal teeth\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Rocky, sandy, well-draining soil\n<strong>Uses:</strong> Ornamental specimen for dry gardens and containers",
    "details": "Agave pachycentra, or Thick-Spined Agave, is a medium rosette succulent from Mexico featuring thick leaves edged with prominent marginal teeth. It thrives in full sun, well-draining rocky or sandy soil, and requires minimal water. This resilient plant is ideal as a striking ornamental specimen for dry gardens, xeriscaping, and container displays."
  },
  {
    "id": "PLANT054",
    "name": "Quadricolor Agave",
    "botanical_name": "Agave lophantha ‘Quadricolor’",
    "image_url": "assets/images/54.png",
    "description": "<strong>Botanical Name:</strong> Agave lophantha ‘Quadricolor’\n<strong>Common Name:</strong> Quadricolor Agave\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Northeastern Mexico\n<strong>Growth Habit:</strong> Small to medium rosette with striking variegated foliage\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; occasional watering in summer\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental, striking foliage for pots, borders, and xeriscaping",
    "details": "Agave lophantha ‘Quadricolor’, or Quadricolor Agave, is a small to medium rosette succulent native to Northeastern Mexico. Its variegated leaves create striking visual interest in pots, borders, or xeriscaped gardens. Thriving in full sun to partial shade and well-draining sandy or rocky soil, it requires low water with occasional summer irrigation."
  },
  {
    "id": "PLANT055",
    "name": "Twin-Flowered Agave",
    "botanical_name": "Agave geminiflora",
    "image_url": "assets/images/55.png",
    "description": "<strong>Botanical Name:</strong> Agave geminiflora\n<strong>Common Name:</strong> Twin-Flowered Agave\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Nayarit, Mexico\n<strong>Growth Habit:</strong> Small, spherical rosette with many narrow leaves, solitary\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy or rocky, well-draining soil\n<strong>Uses:</strong> Ornamental specimen for rock gardens, pots, xeriscaping",
    "details": "Agave geminiflora, known as Twin-Flowered Agave, is a small, spherical rosette succulent from Nayarit, Mexico. It features numerous narrow leaves forming a solitary rosette. This drought-tolerant plant thrives in full sun to partial shade with sandy or rocky well-draining soil, making it a perfect ornamental specimen for rock gardens, containers, and xeriscaping."
  },
  {
    "id": "PLANT056",
    "name": "Oaxaca Agave",
    "botanical_name": "Agave gueingola",
    "image_url": "assets/images/56.png",
    "description": "<strong>Botanical Name:</strong> Agave gueingola\n<strong>Common Name:</strong> Oaxaca Agave\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Oaxaca, Mexico\n<strong>Growth Habit:</strong> Large rosette with broad, paddle-like gray-blue leaves\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining soil, tolerates rocky ground\n<strong>Uses:</strong> Ornamental, striking architectural plant in landscapes",
    "details": "Agave gueingola, known as Oaxaca Agave, is a large rosette succulent from Oaxaca, Mexico. Its broad, paddle-like gray-blue leaves create a striking architectural feature in landscapes. Thriving in full sun to partial shade and well-draining soil, including rocky conditions, this low-water plant is ideal for ornamental and xeriscape designs."
  },
  {
    "id": "PLANT057",
    "name": "Artichoke Agave",
    "botanical_name": "Agave parryi var. truncata",
    "image_url": "assets/images/57.png",
    "description": "<strong>Botanical Name:</strong> Agave parryi var. truncata\n<strong>Common Name:</strong> Artichoke Agave\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Northern Mexico, Arizona (USA)\n<strong>Growth Habit:</strong> Compact rosette resembling an artichoke, slow-growing\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, rocky, well-draining soil\n<strong>Uses:</strong> Ornamental, containers, drought gardens",
    "details": "Agave parryi var. truncata, commonly called Artichoke Agave, is a compact, slow-growing rosette succulent native to Northern Mexico and Arizona. Its artichoke-like form makes it an attractive ornamental for containers or drought gardens. Preferring full sun and sandy, rocky, well-draining soil, it requires minimal watering."
  },
  {
    "id": "PLANT058",
    "name": "Trade Winds Agave",
    "botanical_name": "Agave ‘Trade Winds’",
    "image_url": "assets/images/58.png",
    "description": "<strong>Botanical Name:</strong> Agave ‘Trade Winds’\n<strong>Common Name:</strong> Trade Winds Agave (Cultivar)\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Horticultural hybrid (garden origin)\n<strong>Growth Habit:</strong> Compact, symmetrical rosette, ornamental hybrid\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Ornamental, landscape, containers",
    "details": "Agave ‘Trade Winds’ is a horticultural hybrid known as Trade Winds Agave. It forms a compact, symmetrical rosette, making it ideal for ornamental plantings, landscapes, and container displays. It thrives in full sun to partial shade, with low water requirements and sandy, well-draining soil."
  },
  {
    "id": "PLANT059",
    "name": "Narrowleaf Agave / Curved-Leaved Agave",
    "botanical_name": "Agave striata ssp. falcata",
    "image_url": "assets/images/59.png",
    "description": "<strong>Botanical Name:</strong> Agave striata ssp. falcata\n<strong>Common Name:</strong> Narrowleaf Agave / Curved-Leaved Agave\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Northeastern Mexico\n<strong>Growth Habit:</strong> Dense rosette with slender, falcate leaves\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Very low; highly drought-tolerant\n<strong>Soil Condition:</strong> Rocky, sandy, well-draining soil\n<strong>Uses:</strong> Rock gardens, xeriscaping, architectural accent",
    "details": "Agave striata ssp. falcata, known as Narrowleaf or Curved-Leaved Agave, is a dense rosette succulent from Northeastern Mexico. Its slender, curved leaves form an elegant architectural accent in rock gardens and xeriscaping. Extremely drought-tolerant, it thrives in full sun with rocky, sandy, well-draining soil."
  },
  {
    "id": "PLANT060",
    "name": "Haworthia-like Aloe",
    "botanical_name": "Aloe haworthioides",
    "image_url": "assets/images/60.png",
    "description": "<strong>Botanical Name:</strong> Aloe haworthioides\n<strong>Common Name:</strong> Haworthia-like Aloe\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Small, clustering rosettes with soft, hairy leaves\n<strong>Light Required:</strong> Bright light to partial sun\n<strong>Water Required:</strong> Moderate; allow soil to dry between watering\n<strong>Soil Condition:</strong> Sandy, gritty, well-draining soil\n<strong>Uses:</strong> Ornamental for containers, indoor succulent collections",
    "details": "Aloe haworthioides, or Haworthia-like Aloe, is a small, clustering rosette succulent from Madagascar. Its soft, hairy leaves and compact growth habit make it ideal for container plantings and indoor succulent collections. Preferring bright light to partial sun and sandy, well-draining soil, it requires moderate watering with soil allowed to dry between waterings."
  },
  {
    "id": "PLANT061",
    "name": "Snowflake Aloe",
    "botanical_name": "Aloe rauhii",
    "image_url": "assets/images/61.png",
    "description": "<strong>Botanical Name:</strong> Aloe rauhii\n<strong>Common Name:</strong> Snowflake Aloe\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Small, clumping rosettes with white-flecked leaves\n<strong>Light Required:</strong> Bright indirect light to partial sun\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy soil\n<strong>Uses:</strong> Decorative houseplant, containers, rock gardens",
    "details": "Aloe rauhii, known as Snowflake Aloe, is a small clumping rosette succulent from Madagascar. Its leaves are adorned with white flecks, adding a decorative appeal. Thriving in bright indirect light to partial sun, it prefers well-draining sandy soil and moderate watering, making it ideal for containers, rock gardens, and indoor displays."
  },
  {
    "id": "PLANT062",
    "name": "Pink Blush Aloe",
    "botanical_name": "Aloe ‘Pink Blush’",
    "image_url": "assets/images/62.png",
    "description": "<strong>Botanical Name:</strong> Aloe ‘Pink Blush’\n<strong>Common Name:</strong> Pink Blush Aloe\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Hybrid cultivar\n<strong>Growth Habit:</strong> Compact, clumping aloe with green leaves edged in pink\n<strong>Light Required:</strong> Bright light to partial sun\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Sandy, cactus mix, well-draining\n<strong>Uses:</strong> Ornamental houseplant, pots, mixed succulent displays",
    "details": "Aloe ‘Pink Blush’ is a hybrid cultivar featuring compact, clumping rosettes with green leaves edged in delicate pink. Preferring bright light to partial sun and well-draining sandy or cactus soil, this aloe is low-maintenance and perfect for ornamental houseplants, pots, and mixed succulent arrangements."
  },
  {
    "id": "PLANT063",
    "name": "Doran Black Aloe",
    "botanical_name": "Aloe ‘Doran Black’",
    "image_url": "assets/images/63.png",
    "description": "<strong>Botanical Name:</strong> Aloe ‘Doran Black’\n<strong>Common Name:</strong> Doran Black Aloe\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Hybrid cultivar\n<strong>Growth Habit:</strong> Small, clustering, ornamental hybrid with textured leaves\n<strong>Light Required:</strong> Bright light to partial sun\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy soil\n<strong>Uses:</strong> Decorative succulent for pots, gardens, and rockeries",
    "details": "Aloe ‘Doran Black’ is a small, clustering hybrid aloe with dark, textured leaves, making it a striking ornamental plant. It thrives in bright light to partial sun with well-draining sandy soil, requiring moderate watering. Ideal for pots, rockeries, and succulent garden displays."
  },
  {
    "id": "PLANT064",
    "name": "Aloe (unspecified variety)",
    "botanical_name": "Aloe var.",
    "image_url": "assets/images/64.png",
    "description": "<strong>Botanical Name:</strong> Aloe var.\n<strong>Common Name:</strong> Aloe (unspecified variety)\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Africa / Arabia\n<strong>Growth Habit:</strong> Succulent rosette, varies by species (generally clustering or solitary)\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental, medicinal (general aloe properties), container plant",
    "details": "Aloe var. represents unspecified aloe varieties from Africa and Arabia. These succulent rosettes vary by species, usually clustering or solitary. They thrive in bright light to full sun, with well-draining sandy or rocky soil, moderate watering, and are suitable for ornamental, medicinal, or container plant uses."
  },
  {
    "id": "PLANT065",
    "name": "Aloe (unspecified variety)",
    "botanical_name": "Aloe var.",
    "image_url": "assets/images/65.png",
    "description": "<strong>Botanical Name:</strong> Aloe var.\n<strong>Common Name:</strong> Aloe (unspecified variety)\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Africa / Arabia\n<strong>Growth Habit:</strong> Succulent rosette, varies by species (generally clustering or solitary)\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental, medicinal (general aloe properties), container plant",
    "details": "Aloe var. includes various aloe species from Africa and Arabia. These succulent rosettes may be solitary or form clusters. They prefer bright light to full sun, well-draining sandy or rocky soil, and moderate watering. Ideal for ornamental purposes, container gardening, and general aloe medicinal use."
  },
  {
    "id": "PLANT066",
    "name": "Aloe (unspecified variety)",
    "botanical_name": "Aloe var.",
    "image_url": "assets/images/66.png",
    "description": "<strong>Botanical Name:</strong> Aloe var.\n<strong>Common Name:</strong> Aloe (unspecified variety)\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Africa / Arabia\n<strong>Growth Habit:</strong> Succulent rosette, varies by species (generally clustering or solitary)\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental, medicinal, container plant",
    "details": "Aloe var. represents unspecified aloe varieties from Africa and Arabia. These succulent rosettes can be solitary or form clusters. They prefer bright light to full sun, well-draining sandy or rocky soil, and moderate watering. Ideal for ornamental displays, container gardening, and general aloe medicinal uses."
  },
  {
    "id": "PLANT067",
    "name": "Aloe (unspecified variety)",
    "botanical_name": "Aloe var.",
    "image_url": "assets/images/67.png",
    "description": "<strong>Botanical Name:</strong> Aloe var.\n<strong>Common Name:</strong> Aloe (unspecified variety)\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Africa / Arabia\n<strong>Growth Habit:</strong> Succulent rosette, varies by species (generally clustering or solitary)\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental, medicinal, container plant",
    "details": "Aloe var. includes various unspecified aloe types from Africa and Arabia. These succulents may form clusters or remain solitary. They thrive in bright light to full sun, with well-draining sandy or rocky soil, requiring moderate watering. Perfect for ornamental and medicinal uses as well as container displays."
  },
  {
    "id": "PLANT068",
    "name": "Jacunda Aloe",
    "botanical_name": "Aloe jacunda",
    "image_url": "assets/images/68.png",
    "description": "<strong>Botanical Name:</strong> Aloe jacunda\n<strong>Common Name:</strong> Jacunda Aloe\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Somalia\n<strong>Growth Habit:</strong> Small rosettes, often clustering; narrow, spotted leaves\n<strong>Light Required:</strong> Bright sun to partial shade\n<strong>Water Required:</strong> Moderate; allow soil to dry between watering\n<strong>Soil Condition:</strong> Sandy, rocky, well-draining\n<strong>Uses:</strong> Ornamental succulent for collections and pots",
    "details": "Aloe jacunda, or Jacunda Aloe, is a small, clustering succulent from Somalia with narrow, spotted leaves. Thriving in bright sun to partial shade and well-draining sandy or rocky soil, it requires moderate watering. Ideal for ornamental collections and container displays."
  },
  {
    "id": "PLANT069",
    "name": "Book Aloe",
    "botanical_name": "Aloe suprafoliata",
    "image_url": "assets/images/69.png",
    "description": "<strong>Botanical Name:</strong> Aloe suprafoliata\n<strong>Common Name:</strong> Book Aloe\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Solitary, stemless rosette; juvenile leaves arranged like an open book\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Rocky, sandy, well-draining soil\n<strong>Uses:</strong> Ornamental, architectural succulent for xeriscaping",
    "details": "Aloe suprafoliata, known as Book Aloe, is a solitary, stemless rosette succulent from South Africa. Its juvenile leaves open like a book, creating a striking architectural form. Preferring full sun, well-draining rocky or sandy soil, and moderate watering, it is ideal for ornamental xeriscaping and garden architecture."
  },
  {
    "id": "PLANT070",
    "name": "Sinkatana Aloe",
    "botanical_name": "Aloe sinkatana",
    "image_url": "assets/images/70.png",
    "description": "<strong>Botanical Name:</strong> Aloe sinkatana\n<strong>Common Name:</strong> Sinkatana Aloe\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Sudan\n<strong>Growth Habit:</strong> Small to medium-sized rosette; spotted leaves, pinkish margins\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, gritty soil\n<strong>Uses:</strong> Ornamental, containers, succulent collections",
    "details": "Aloe sinkatana, or Sinkatana Aloe, is a small to medium rosette succulent from Sudan. Its spotted leaves with pinkish margins make it visually striking. It grows best in bright light to full sun, well-draining gritty soil, and moderate watering. Perfect for ornamental containers and succulent collections."
  },
  {
    "id": "PLANT071",
    "name": "Aloe (unspecified species)",
    "botanical_name": "Aloe sp.",
    "image_url": "assets/images/71.png",
    "description": "<strong>Botanical Name:</strong> Aloe sp.\n<strong>Common Name:</strong> Aloe (unspecified species)\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Africa / Arabia (varies by species)\n<strong>Growth Habit:</strong> Succulent rosette, may be clustering or solitary depending on species\n<strong>Light Required:</strong> Full sun to bright light\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, gritty, well-draining soil\n<strong>Uses:</strong> Ornamental, containers, some species medicinal",
    "details": "Aloe sp. represents unspecified species of aloe from Africa and Arabia. These succulent rosettes may grow solitary or in clusters depending on the species. They thrive in full sun to bright light, require sandy, gritty, well-draining soil, and moderate watering. Suitable for ornamental planting, containers, and some species have medicinal uses."
  },
  {
    "id": "PLANT072",
    "name": "Aloe (unspecified species)",
    "botanical_name": "Aloe sp.",
    "image_url": "assets/images/72.png",
    "description": "<strong>Botanical Name:</strong> Aloe sp.\n<strong>Common Name:</strong> Aloe (unspecified species)\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Africa / Arabia (varies by species)\n<strong>Growth Habit:</strong> Succulent rosette, may be clustering or solitary depending on species\n<strong>Light Required:</strong> Full sun to bright light\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, gritty, well-draining soil\n<strong>Uses:</strong> Ornamental, containers",
    "details": "Aloe sp. includes unspecified aloe species from Africa and Arabia. They may grow in clusters or individually. Prefers full sun to bright light, moderate watering, and sandy, well-draining soil. Ideal for ornamental planting and container displays."
  },
  {
    "id": "PLANT073",
    "name": "Dwarf Aloe / Miniature Aloe",
    "botanical_name": "Aloe pepe",
    "image_url": "assets/images/73.png",
    "description": "<strong>Botanical Name:</strong> Aloe pepe\n<strong>Common Name:</strong> Dwarf Aloe / Miniature Aloe\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Hybrid cultivar (horticultural)\n<strong>Growth Habit:</strong> Very small rosette; compact, ornamental dwarf aloe\n<strong>Light Required:</strong> Bright indirect light to partial sun\n<strong>Water Required:</strong> Moderate; water sparingly\n<strong>Soil Condition:</strong> Well-draining, cactus mix\n<strong>Uses:</strong> Ornamental, miniature succulent collections, indoor pots",
    "details": "Aloe pepe is a hybrid dwarf aloe suitable for ornamental and miniature succulent collections. It forms very small, compact rosettes and thrives in bright indirect light to partial sun. Use well-draining cactus mix soil and water sparingly. Perfect for indoor pots and decorative arrangements."
  },
  {
    "id": "PLANT074",
    "name": "Spider Aloe",
    "botanical_name": "Aloe humilis",
    "image_url": "assets/images/74.png",
    "description": "<strong>Botanical Name:</strong> Aloe humilis\n<strong>Common Name:</strong> Spider Aloe\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Small, clustering aloe with spiny blue-green leaves\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low to moderate; drought-tolerant\n<strong>Soil Condition:</strong> Rocky, sandy, well-draining soil\n<strong>Uses:</strong> Ornamental rock garden plant, container specimen",
    "details": "Aloe humilis, or Spider Aloe, is a small, clustering succulent from South Africa. It features spiny blue-green leaves and thrives in full sun to partial shade with rocky, well-draining soil. Requires low to moderate watering. Ideal for rock gardens and container planting as an ornamental specimen."
  },
  {
    "id": "PLANT075",
    "name": "Spanish Bayonet / Aloe Yucca",
    "botanical_name": "Yucca aloifolia",
    "image_url": "assets/images/75.png",
    "description": "<strong>Botanical Name:</strong> Yucca aloifolia\n<strong>Common Name:</strong> Spanish Bayonet, Aloe Yucca\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Southeastern United States, Mexico, Caribbean\n<strong>Growth Habit:</strong> Evergreen, tree-like shrub with sharp, sword-shaped leaves; can grow 3–6 m tall\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; very drought-tolerant\n<strong>Soil Condition:</strong> Sandy, rocky, well-draining soil; tolerates poor soils\n<strong>Uses:</strong> Ornamental landscaping, coastal gardens, xeriscaping, barrier/hedge plant",
    "details": "Yucca aloifolia, also known as Spanish Bayonet or Aloe Yucca, is an evergreen, tree-like shrub that can reach 3–6 meters. It has sharp, sword-shaped leaves, thrives in full sun, tolerates poor soils, and requires low water. Perfect for ornamental landscaping, coastal gardens, xeriscaping, and barrier planting."
  },
  {
    "id": "PLANT076",
    "name": "Desert Spoon / Spoon Yucca / Sotol",
    "botanical_name": "Dasylirion wheeleri",
    "image_url": "assets/images/76.png",
    "description": "<strong>Botanical Name:</strong> Dasylirion wheeleri\n<strong>Common Name:</strong> Desert Spoon, Spoon Yucca, Sotol\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Southwestern United States (Arizona, New Mexico, Texas) and Northern Mexico\n<strong>Growth Habit:</strong> Slow-growing rosette with long, narrow, serrated leaves; trunk-forming with age\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Very low; highly drought-resistant\n<strong>Soil Condition:</strong> Well-draining, sandy or gravelly soil; thrives in arid conditions\n<strong>Uses:</strong> Ornamental desert landscaping, xeriscaping, traditional use in making sotol (a distilled spirit)",
    "details": "Dasylirion wheeleri, known as Desert Spoon, Spoon Yucca, or Sotol, is a slow-growing rosette plant with long, serrated leaves that may form a trunk with age. Thrives in full sun, arid, sandy or gravelly soil, and requires very low water. Used for ornamental desert landscaping, xeriscaping, and traditional sotol production."
  },
  {
    "id": "PLANT077",
    "name": "Crown of Thorns ‘Red’",
    "botanical_name": "Euphorbia milii ‘Red’",
    "image_url": "assets/images/77.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia milii ‘Red’\n<strong>Common Name:</strong> Crown of Thorns ‘Red’\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Madagascar (hybrid cultivar)\n<strong>Growth Habit:</strong> Thorny, evergreen shrub with thick stems; produces vibrant red bracts around small flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low to moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining sandy or loamy soil\n<strong>Uses:</strong> Ornamental, garden borders, pots, balcony decoration, flowering houseplant",
    "details": "Euphorbia milii ‘Red’, also called Crown of Thorns ‘Red’, is a thorny evergreen shrub with thick stems and bright red bracts around tiny flowers. It thrives in full sun to partial shade, requires low to moderate water, and well-draining sandy or loamy soil. Ideal for ornamental pots, garden borders, or balcony decoration."
  },
  {
    "id": "PLANT078",
    "name": "Crown of Thorns ‘Pink’",
    "botanical_name": "Euphorbia milii ‘Pink’",
    "image_url": "assets/images/78.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia milii ‘Pink’\n<strong>Common Name:</strong> Crown of Thorns ‘Pink’\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Madagascar (hybrid cultivar)\n<strong>Growth Habit:</strong> Shrubby, spiny succulent with clusters of pink bracts and flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Moderate; drought-tolerant when established\n<strong>Soil Condition:</strong> Sandy, gritty, well-draining soil\n<strong>Uses:</strong> Ornamental in gardens and containers, indoor decoration with bright light",
    "details": "Euphorbia milii ‘Pink’ is a spiny, shrubby succulent featuring clusters of pink bracts and flowers. Prefers full sun to partial shade, moderate watering, and well-draining sandy soil. Suitable for ornamental gardens, containers, and indoor decoration with bright light."
  },
  {
    "id": "PLANT079",
    "name": "Crown of Thorns ‘White’",
    "botanical_name": "Euphorbia milii ‘White’",
    "image_url": "assets/images/79.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia milii ‘White’\n<strong>Common Name:</strong> Crown of Thorns ‘White’\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Madagascar (cultivar)\n<strong>Growth Habit:</strong> Evergreen, thorny shrub with white-colored bracts around small yellow flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Well-draining sandy or rocky soil\n<strong>Uses:</strong> Ornamental pot plant, landscaping, decorative flowering succulent",
    "details": "Euphorbia milii ‘White’ is an evergreen, thorny shrub with white bracts surrounding small yellow flowers. Thrives in full sun to partial shade, requires low to moderate watering, and well-draining sandy or rocky soil. Perfect for ornamental pots, landscaping, or decorative flowering displays."
  },
  {
    "id": "PLANT080",
    "name": "Crown of Thorns ‘Big Red’",
    "botanical_name": "Euphorbia milii ‘Big Red’",
    "image_url": "assets/images/80.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia milii ‘Big Red’\n<strong>Common Name:</strong> Crown of Thorns ‘Big Red’\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Madagascar (cultivar hybrid)\n<strong>Growth Habit:</strong> Shrubby succulent with long spines, producing large deep-red bracts\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Moderate; water sparingly\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Ornamental for pots, hedges, and vibrant flowering display in gardens",
    "details": "Euphorbia milii ‘Big Red’ is a shrubby succulent with long spines and large deep-red bracts. Prefers full sun to partial shade, moderate watering, and well-draining sandy soil. Excellent for ornamental pots, garden hedges, and vibrant flowering displays."
  },
  {
    "id": "PLANT081",
    "name": "Narrow-leaf Chalksticks (Green form)",
    "botanical_name": "Senecio vitalis ‘Green’",
    "image_url": "assets/images/81.png",
    "description": "<strong>Botanical Name:</strong> Senecio vitalis ‘Green’\n<strong>Common Name:</strong> Narrow-leaf Chalksticks (Green form)\n<strong>Family:</strong> Asteraceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Evergreen succulent, spreading/clumping, narrow upright green leaves\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental ground cover, rock gardens, xeriscaping",
    "details": "Senecio vitalis ‘Green’ is an evergreen succulent with narrow upright green leaves, forming a spreading or clumping habit. Prefers full sun, low water, and well-draining sandy or rocky soil. Ideal as ground cover, in rock gardens, and for xeriscaping."
  },
  {
    "id": "PLANT082",
    "name": "Narrow-leaf Chalksticks (Silver form)",
    "botanical_name": "Senecio vitalis ‘Silver’",
    "image_url": "assets/images/82.png",
    "description": "<strong>Botanical Name:</strong> Senecio vitalis ‘Silver’\n<strong>Common Name:</strong> Narrow-leaf Chalksticks (Silver form)\n<strong>Family:</strong> Asteraceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Succulent groundcover with narrow silvery-blue leaves\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, gritty, well-draining soil\n<strong>Uses:</strong> Ornamental for borders, xeriscaping, coastal planting",
    "details": "Senecio vitalis ‘Silver’ is a succulent groundcover with narrow silvery-blue leaves. Thrives in full sun, low water, and well-draining sandy or gritty soil. Perfect for ornamental borders, xeriscaping, and coastal gardens."
  },
  {
    "id": "PLANT083",
    "name": "Big Blue Chalksticks",
    "botanical_name": "Senecio ficoides",
    "image_url": "assets/images/83.png",
    "description": "<strong>Botanical Name:</strong> Senecio ficoides\n<strong>Common Name:</strong> Big Blue Chalksticks\n<strong>Family:</strong> Asteraceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Spreading succulent shrub with upright blue-gray leaves\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining, sandy soil\n<strong>Uses:</strong> Ground cover, ornamental for dry gardens, coastal landscaping",
    "details": "Senecio ficoides is a spreading succulent shrub with upright blue-gray leaves. Requires full sun, low water, and well-draining sandy soil. Excellent for ground cover, dry gardens, and coastal landscaping."
  },
  {
    "id": "PLANT084",
    "name": "Red-Flowered Senecio",
    "botanical_name": "Senecio cephalophorus",
    "image_url": "assets/images/84.png",
    "description": "<strong>Botanical Name:</strong> Senecio cephalophorus\n<strong>Common Name:</strong> Red-Flowered Senecio\n<strong>Family:</strong> Asteraceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Succulent shrub with cylindrical gray-green leaves and bright red-orange flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Moderate to low\n<strong>Soil Condition:</strong> Sandy, rocky, well-draining soil\n<strong>Uses:</strong> Ornamental, adds vibrant color to succulent gardens",
    "details": "Senecio cephalophorus is a succulent shrub with cylindrical gray-green leaves and bright red-orange flowers. Thrives in full sun, requires moderate to low water, and well-draining sandy or rocky soil. Adds vibrant color to succulent gardens."
  },
  {
    "id": "PLANT085",
    "name": "Golden Sedum",
    "botanical_name": "Sedum adolphi",
    "image_url": "assets/images/85.png",
    "description": "<strong>Botanical Name:</strong> Sedum adolphi\n<strong>Common Name:</strong> Golden Sedum\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Low-growing, trailing succulent with green leaves turning golden-yellow in sun\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining, sandy or cactus mix\n<strong>Uses:</strong> Ground cover, rock gardens, hanging baskets, containers",
    "details": "Sedum adolphi is a low-growing trailing succulent with green leaves that turn golden-yellow in sun. Prefers full sun to partial shade, low water, and well-draining sandy or cactus mix. Ideal as ground cover, in rock gardens, hanging baskets, or containers."
  },
  {
    "id": "PLANT086",
    "name": "Fire Storm Sedum",
    "botanical_name": "Sedum adolphi ‘Fire Storm’",
    "image_url": "assets/images/86.png",
    "description": "<strong>Botanical Name:</strong> Sedum adolphi ‘Fire Storm’\n<strong>Common Name:</strong> Fire Storm Sedum\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Mexico (cultivar)\n<strong>Growth Habit:</strong> Compact trailing succulent; green leaves with fiery red-orange tips in bright sun\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining, sandy or rocky soil\n<strong>Uses:</strong> Ornamental ground cover, containers, rock gardens",
    "details": "Sedum adolphi ‘Fire Storm’ is a compact trailing succulent with green leaves that develop fiery red-orange tips under bright sun. Prefers full sun to partial shade, low water, and well-draining sandy or rocky soil. Ideal for ground cover, containers, and rock gardens."
  },
  {
    "id": "PLANT087",
    "name": "Stonecrop (unspecified species)",
    "botanical_name": "Sedum sp.",
    "image_url": "assets/images/87.png",
    "description": "<strong>Botanical Name:</strong> Sedum sp.\n<strong>Common Name:</strong> Stonecrop (unspecified species)\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Worldwide (varies by species)\n<strong>Growth Habit:</strong> Succulent ground cover or clumping form depending on species\n<strong>Light Required:</strong> Full sun to light shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, gritty, well-draining soil\n<strong>Uses:</strong> Rock gardens, ground cover, containers",
    "details": "Sedum sp. (Stonecrop) is a succulent ground cover or clumping plant depending on species. Thrives in full sun to light shade, low water, and well-draining sandy or gritty soil. Perfect for rock gardens, ground cover, or container planting."
  },
  {
    "id": "PLANT088",
    "name": "Vertical Leaf Senecio / Propeller Plant",
    "botanical_name": "Senecio crassissimus",
    "image_url": "assets/images/88.png",
    "description": "<strong>Botanical Name:</strong> Senecio crassissimus\n<strong>Common Name:</strong> Vertical Leaf Senecio, Propeller Plant\n<strong>Family:</strong> Asteraceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Upright succulent with flattened, vertical gray-green leaves edged in purple\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining, sandy soil\n<strong>Uses:</strong> Ornamental accent plant, xeriscaping, containers",
    "details": "Senecio crassissimus is an upright succulent with flattened, vertical gray-green leaves edged in purple. Prefers full sun, low water, and well-draining sandy soil. Ideal as an ornamental accent plant, for xeriscaping, and container planting."
  },
  {
    "id": "PLANT089",
    "name": "Echeveria (unspecified species)",
    "botanical_name": "Echeveria sp.",
    "image_url": "assets/images/89.png",
    "description": "<strong>Botanical Name:</strong> Echeveria sp.\n<strong>Common Name:</strong> Echeveria (unspecified species)\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Central America, Mexico\n<strong>Growth Habit:</strong> Rosette-forming succulent; may be solitary or clustering\n<strong>Light Required:</strong> Full sun to bright light\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, gritty, well-draining soil\n<strong>Uses:</strong> Ornamental pots, rock gardens, succulent arrangements",
    "details": "Echeveria sp. is a rosette-forming succulent that may be solitary or clustering. Thrives in full sun to bright light, moderate water, and well-draining sandy or gritty soil. Suitable for ornamental pots, rock gardens, and succulent arrangements."
  },
  {
    "id": "PLANT090",
    "name": "Echeveria (unspecified species)",
    "botanical_name": "Echeveria sp.",
    "image_url": "assets/images/90.png",
    "description": "<strong>Botanical Name:</strong> Echeveria sp.\n<strong>Common Name:</strong> Echeveria (unspecified species)\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Central America, Mexico\n<strong>Growth Habit:</strong> Rosette-forming succulent; often colorful or with waxy leaves\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate; allow soil to dry between watering\n<strong>Soil Condition:</strong> Well-draining cactus mix or sandy soil\n<strong>Uses:</strong> Ornamental for containers, succulent gardens, indoor pots",
    "details": "Echeveria sp. is a rosette-forming succulent, often colorful or with waxy leaves. Prefers bright light to full sun, moderate water, and well-draining cactus mix or sandy soil. Ideal for ornamental containers, succulent gardens, and indoor pots."
  },
  {
    "id": "PLANT091",
    "name": "Echeveria (unspecified species)",
    "botanical_name": "Echeveria sp.",
    "image_url": "assets/images/91.png",
    "description": "<strong>Botanical Name:</strong> Echeveria sp.\n<strong>Common Name:</strong> Echeveria (unspecified species)\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Mexico, Central America\n<strong>Growth Habit:</strong> Rosette-forming succulent with fleshy leaves\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining cactus or succulent mix\n<strong>Uses:</strong> Ornamental plant, pots, succulent gardens",
    "details": "Echeveria sp. is a rosette-forming succulent with fleshy leaves. Thrives in bright light to full sun, moderate water, and well-draining cactus or succulent mix. Suitable for ornamental pots and succulent gardens."
  },
  {
    "id": "PLANT092",
    "name": "Blue Spruce Stonecrop",
    "botanical_name": "Sedum reflexum",
    "image_url": "assets/images/92.png",
    "description": "<strong>Botanical Name:</strong> Sedum reflexum\n<strong>Common Name:</strong> Blue Spruce Stonecrop\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Europe\n<strong>Growth Habit:</strong> Low-growing, mat-forming succulent with blue-green needle-like leaves\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining sandy or rocky soil\n<strong>Uses:</strong> Ground cover, rock gardens, green roofs, containers",
    "details": "Sedum reflexum is a low-growing, mat-forming succulent with blue-green needle-like leaves. Prefers full sun, low water, and well-draining sandy or rocky soil. Perfect for ground cover, rock gardens, green roofs, or containers."
  },
  {
    "id": "PLANT093",
    "name": "Chubby Echeveria",
    "botanical_name": "Echeveria ‘Chubby’",
    "image_url": "assets/images/93.png",
    "description": "<strong>Botanical Name:</strong> Echeveria ‘Chubby’\n<strong>Common Name:</strong> Chubby Echeveria\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Mexico (cultivar)\n<strong>Growth Habit:</strong> Compact rosettes with plump, pastel-green to bluish leaves\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Well-draining cactus/succulent mix\n<strong>Uses:</strong> Decorative pots, succulent arrangements",
    "details": "Echeveria ‘Chubby’ forms compact rosettes with plump, pastel-green to bluish leaves. Thrives in bright light to full sun, low to moderate water, and well-draining cactus or succulent mix. Ideal for decorative pots and succulent arrangements."
  },
  {
    "id": "PLANT094",
    "name": "Pachyveria",
    "botanical_name": "Pachyveria sp.",
    "image_url": "assets/images/94.png",
    "description": "<strong>Botanical Name:</strong> Pachyveria sp. (hybrid of Pachyphytum × Echeveria)\n<strong>Common Name:</strong> Pachyveria\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Mexico (hybrid origin)\n<strong>Growth Habit:</strong> Rosette-forming succulent with thick, fleshy leaves\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining sandy or rocky soil\n<strong>Uses:</strong> Ornamental, succulent gardens, mixed containers",
    "details": "Pachyveria is a hybrid rosette-forming succulent with thick, fleshy leaves. Prefers full sun to partial shade, moderate water, and well-draining sandy or rocky soil. Suitable for ornamental planting, succulent gardens, and mixed containers."
  },
  {
    "id": "PLANT095",
    "name": "Liveforever",
    "botanical_name": "Dudleya sp.",
    "image_url": "assets/images/95.png",
    "description": "<strong>Botanical Name:</strong> Dudleya sp.\n<strong>Common Name:</strong> Liveforever\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Southwestern USA, Mexico\n<strong>Growth Habit:</strong> Rosette-forming succulents, often with chalky or powdery leaves\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Rocky, sandy, very well-draining soil\n<strong>Uses:</strong> Rock gardens, native plant gardens, ornamental succulent",
    "details": "Dudleya sp., also called Liveforever, forms rosettes with chalky or powdery leaves. Thrives in bright light to full sun, low water, and rocky, sandy, very well-draining soil. Perfect for rock gardens, native plant gardens, and ornamental succulent displays."
  },
  {
    "id": "PLANT096",
    "name": "Crimnosedum (hybrid succulent)",
    "botanical_name": "Crassula × Sedum hybrid",
    "image_url": "assets/images/96.png",
    "description": "<strong>Botanical Name:</strong> Crassula × Sedum hybrid (Crimnosedum – cultivar/hybrid group)\n<strong>Common Name:</strong> Crimnosedum (hybrid succulent)\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Hybrid origin\n<strong>Growth Habit:</strong> Small succulent with compact, clustered leaves; variable depending on hybrid\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Well-draining cactus/succulent mix\n<strong>Uses:</strong> Decorative, succulent gardens, mixed containers",
    "details": "Crimnosedum is a small hybrid succulent with compact clustered leaves. Prefers bright light to full sun, moderate water, and well-draining cactus/succulent mix. Ideal for decorative use, succulent gardens, and mixed containers."
  },
  {
    "id": "PLANT097",
    "name": "Purple Von Verg Echeveria",
    "botanical_name": "Echeveria ‘Purple Von Verg’",
    "image_url": "assets/images/97.png",
    "description": "<strong>Botanical Name:</strong> Echeveria ‘Purple Von Verg’\n<strong>Common Name:</strong> Purple Von Verg Echeveria\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Mexico (cultivar)\n<strong>Growth Habit:</strong> Rosette succulent with striking purple-lavender leaves\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Well-draining sandy or cactus mix\n<strong>Uses:</strong> Ornamental, decorative pots, succulent arrangements",
    "details": "Echeveria ‘Purple Von Verg’ is a rosette succulent with striking purple-lavender leaves. Thrives in bright light to full sun, low to moderate water, and well-draining sandy or cactus mix. Suitable for ornamental pots and succulent arrangements."
  },
  {
    "id": "PLANT098",
    "name": "Hens and Chicks",
    "botanical_name": "Sempervivum sp.",
    "image_url": "assets/images/98.png",
    "description": "<strong>Botanical Name:</strong> Sempervivum sp.\n<strong>Common Name:</strong> Hens and Chicks\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Europe, Asia Minor\n<strong>Growth Habit:</strong> Small, hardy rosettes that produce “chicks” (offsets) around the main rosette\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Rocky, sandy, well-draining soil\n<strong>Uses:</strong> Rock gardens, alpine gardens, green roofs, containers",
    "details": "Sempervivum sp., known as Hens and Chicks, forms small, hardy rosettes that produce offsets around the main plant. Prefers full sun, low water, and rocky, sandy, well-draining soil. Ideal for rock gardens, alpine gardens, green roofs, and containers."
  },
  {
    "id": "PLANT099",
    "name": "Blue Rose Echeveria",
    "botanical_name": "Echeveria imbricata",
    "image_url": "assets/images/99.png",
    "description": "<strong>Botanical Name:</strong> Echeveria imbricata\n<strong>Common Name:</strong> Blue Rose Echeveria\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Rosette succulent with overlapping blue-green leaves; produces offsets\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Ornamental pots, ground cover in succulent gardens",
    "details": "Echeveria imbricata, or Blue Rose Echeveria, is a rosette succulent with overlapping blue-green leaves that produce offsets. Prefers full sun to partial shade, low to moderate water, and well-draining sandy soil. Perfect for ornamental pots and succulent garden ground cover."
  },
  {
    "id": "PLANT100",
    "name": "Loli Echeveria",
    "botanical_name": "Echeveria ‘Loli’",
    "image_url": "assets/images/100.png",
    "description": "<strong>Botanical Name:</strong> Echeveria ‘Loli’\n<strong>Common Name:</strong> Loli Echeveria\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Mexico (cultivar)\n<strong>Growth Habit:</strong> Small rosette succulent with thick, rounded leaves, often pastel or bluish tones\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining cactus/succulent mix\n<strong>Uses:</strong> Decorative pots, succulent arrangements, small gardens",
    "details": "Echeveria ‘Loli’ forms small rosettes with thick, rounded leaves in pastel or bluish tones. Thrives in bright light to full sun, low water, and well-draining cactus/succulent mix. Ideal for decorative pots, succulent arrangements, and small gardens."
  },
  {
    "id": "PLANT101",
    "name": "Silver Thicket",
    "botanical_name": "Euphorbia stenoclada",
    "image_url": "assets/images/101.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia stenoclada\n<strong>Common Name:</strong> Silver Thicket\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Thorny, gray-green succulent shrub up to 6 m tall\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Very low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, rocky, well-draining\n<strong>Uses:</strong> Ornamental, hedges, xeriscaping",
    "details": "Euphorbia stenoclada, or Silver Thicket, is a thorny, gray-green succulent shrub growing up to 6 m. Requires full sun, very low water, and sandy, rocky, well-draining soil. Ideal for ornamental hedges and xeriscaping."
  },
  {
    "id": "PLANT102",
    "name": "Golden Barrel Cactus",
    "botanical_name": "Echinocactus grusonii",
    "image_url": "assets/images/102.png",
    "description": "<strong>Botanical Name:</strong> Echinocactus grusonii\n<strong>Common Name:</strong> Golden Barrel Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Round, barrel-shaped cactus with golden spines\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Rock gardens, ornamental cactus, xeriscaping",
    "details": "Echinocactus grusonii, the Golden Barrel Cactus, is a round, barrel-shaped cactus with golden spines. Prefers full sun, low water, and sandy, well-draining soil. Perfect for rock gardens, ornamental cactus displays, and xeriscaping."
  },
  {
    "id": "PLANT103",
    "name": "Senile Rebutia",
    "botanical_name": "Rebutia senilis",
    "image_url": "assets/images/103.png",
    "description": "<strong>Botanical Name:</strong> Rebutia senilis\n<strong>Common Name:</strong> Senile Rebutia\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Bolivia\n<strong>Growth Habit:</strong> Small, clustering cactus with spines and red/orange flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Ornamental potted cactus, collectors’ plant",
    "details": "Rebutia senilis, or Senile Rebutia, is a small clustering cactus with spines and red/orange flowers. Thrives in full sun to partial shade, moderate water, and well-draining sandy soil. Ideal for ornamental potted cactus and collectors’ displays."
  },
  {
    "id": "PLANT104",
    "name": "Old Man of the Andes",
    "botanical_name": "Oreocereus celsianus",
    "image_url": "assets/images/104.png",
    "description": "<strong>Botanical Name:</strong> Oreocereus celsianus\n<strong>Common Name:</strong> Old Man of the Andes\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Andes Mountains (Peru, Bolivia, Argentina)\n<strong>Growth Habit:</strong> Columnar cactus covered in long white hairs\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Rocky, sandy, well-draining\n<strong>Uses:</strong> Ornamental cactus, xeriscaping",
    "details": "Oreocereus celsianus, known as Old Man of the Andes, is a columnar cactus with long white hairs. Requires full sun, low water, and rocky, sandy, well-draining soil. Great for ornamental cactus displays and xeriscaping."
  },
  {
    "id": "PLANT105",
    "name": "Sun-loving Rebutia",
    "botanical_name": "Rebutia heliosa",
    "image_url": "assets/images/105.png",
    "description": "<strong>Botanical Name:</strong> Rebutia heliosa\n<strong>Common Name:</strong> Sun-loving Rebutia\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Bolivia\n<strong>Growth Habit:</strong> Small, clustering cactus with orange flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Well-draining cactus mix\n<strong>Uses:</strong> Ornamental, potted cactus",
    "details": "Rebutia heliosa, the Sun-loving Rebutia, is a small clustering cactus with orange flowers. Prefers full sun, moderate water, and well-draining cactus mix. Ideal for ornamental potted cactus displays."
  },
  {
    "id": "PLANT106",
    "name": "Silver Ball Cactus",
    "botanical_name": "Parodia scopa var. inermis",
    "image_url": "assets/images/106.png",
    "description": "<strong>Botanical Name:</strong> Parodia scopa var. inermis (syn. Notocactus scopa inermis)\n<strong>Common Name:</strong> Silver Ball Cactus (spineless form)\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Brazil, Uruguay\n<strong>Growth Habit:</strong> Small, globular cactus with dense wool but fewer or no spines\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Moderate; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Ornamental cactus for pots and gardens",
    "details": "Parodia scopa var. inermis, also called Silver Ball Cactus (spineless form), is a small globular cactus with dense wool but minimal spines. Requires full sun, moderate watering, and well-draining sandy soil. Ideal for ornamental pots and garden displays."
  },
  {
    "id": "PLANT107",
    "name": "Parodia cactus",
    "botanical_name": "Parodia sp.",
    "image_url": "assets/images/107.png",
    "description": "<strong>Botanical Name:</strong> Parodia sp.\n<strong>Common Name:</strong> Parodia cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> South America (Brazil, Argentina, Uruguay)\n<strong>Growth Habit:</strong> Small globular cactus with colorful flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental cactus",
    "details": "Parodia sp., commonly called Parodia cactus, is a small globular cactus with colorful flowers. Thrives in full sun, moderate watering, and sandy well-draining soil. Great for ornamental cactus displays."
  },
  {
    "id": "PLANT108",
    "name": "Warasii Parodia",
    "botanical_name": "Parodia warasii",
    "image_url": "assets/images/108.png",
    "description": "<strong>Botanical Name:</strong> Parodia warasii\n<strong>Common Name:</strong> Warasii Parodia\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Southern Brazil\n<strong>Growth Habit:</strong> Globular to short-columnar cactus with golden-yellow spines\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Ornamental, collectors’ cactus",
    "details": "Parodia warasii, or Warasii Parodia, is a globular to short-columnar cactus with golden-yellow spines. Prefers full sun to partial shade, moderate water, and well-draining sandy soil. Suitable for ornamental and collectors’ cactus displays."
  },
  {
    "id": "PLANT109",
    "name": "Parodia cactus",
    "botanical_name": "Parodia sp.",
    "image_url": "assets/images/109.png",
    "description": "<strong>Botanical Name:</strong> Parodia sp.\n<strong>Common Name:</strong> Parodia cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> South America\n<strong>Growth Habit:</strong> Globular cactus with ribbed structure and showy flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental, pots, rock gardens",
    "details": "Parodia sp., called Parodia cactus, is a globular cactus with ribbed structure and showy flowers. Thrives in full sun, low to moderate water, and sandy well-draining soil. Perfect for ornamental pots and rock gardens."
  },
  {
    "id": "PLANT110",
    "name": "Albino Mammillaria",
    "botanical_name": "Mammillaria albicoma",
    "image_url": "assets/images/110.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria albicoma (sometimes listed as albiniata)\n<strong>Common Name:</strong> Albino Mammillaria\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Small globular cactus with white wool and radial spines\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental, potted cactus",
    "details": "Mammillaria albicoma, also known as Albino Mammillaria, is a small globular cactus with white wool and radial spines. Prefers full sun, low watering, and sandy well-draining soil. Ideal for ornamental potted cactus."
  },
  {
    "id": "PLANT111",
    "name": "Proliferating Pincushion Cactus",
    "botanical_name": "Mammillaria prolifera",
    "image_url": "assets/images/111.png",
    "description": "<strong>Botanical Name:</strong> Mammillaria prolifera\n<strong>Common Name:</strong> Proliferating Pincushion Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico, Caribbean, Central America\n<strong>Growth Habit:</strong> Clustering small globular cactus with hooked spines and yellow flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Sandy, rocky, well-draining\n<strong>Uses:</strong> Ornamental, pots, rock gardens",
    "details": "Mammillaria prolifera, known as Proliferating Pincushion Cactus, is a clustering small globular cactus with hooked spines and yellow flowers. Prefers full sun, moderate watering, and sandy, rocky well-draining soil. Suitable for ornamental pots and rock gardens."
  },
  {
    "id": "PLANT112",
    "name": "Copiapoa cactus",
    "botanical_name": "Copiapoa sp.",
    "image_url": "assets/images/112.png",
    "description": "<strong>Botanical Name:</strong> Copiapoa sp.\n<strong>Common Name:</strong> Copiapoa cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Chile (Atacama Desert)\n<strong>Growth Habit:</strong> Globular to columnar cactus, often gray-green with woolly tops\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Very low; drought-tolerant\n<strong>Soil Condition:</strong> Rocky, sandy, desert soil\n<strong>Uses:</strong> Ornamental, collectors’ cactus",
    "details": "Copiapoa sp., or Copiapoa cactus, is a globular to columnar cactus, often gray-green with woolly tops. Thrives in full sun, very low water, and rocky, sandy desert soil. Ideal for ornamental and collectors’ cactus."
  },
  {
    "id": "PLANT113",
    "name": "Pseudoglobose Echinopsis",
    "botanical_name": "Echinopsis pseudoglobulosa",
    "image_url": "assets/images/113.png",
    "description": "<strong>Botanical Name:</strong> Echinopsis pseudoglobulosa\n<strong>Common Name:</strong> Pseudoglobose Echinopsis\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Bolivia\n<strong>Growth Habit:</strong> Small globular cactus producing large, showy flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Ornamental, flowering cactus",
    "details": "Echinopsis pseudoglobulosa, called Pseudoglobose Echinopsis, is a small globular cactus producing large, showy flowers. Prefers full sun to partial shade, moderate watering, and well-draining sandy soil. Perfect for ornamental flowering cactus."
  },
  {
    "id": "PLANT114",
    "name": "Bishop’s Cap Cactus",
    "botanical_name": "Astrophytum ornatum",
    "image_url": "assets/images/114.png",
    "description": "<strong>Botanical Name:</strong> Astrophytum ornatum\n<strong>Common Name:</strong> Bishop’s Cap Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Columnar cactus with ribs and white speckles; produces yellow flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental cactus, collectors’ plant",
    "details": "Astrophytum ornatum, or Bishop’s Cap Cactus, is a columnar cactus with ribs and white speckles that produces yellow flowers. Requires full sun, low watering, and sandy well-draining soil. Suitable for ornamental and collectors’ cactus."
  },
  {
    "id": "PLANT115",
    "name": "Sand Dollar Cactus",
    "botanical_name": "Astrophytum asterias",
    "image_url": "assets/images/115.png",
    "description": "<strong>Botanical Name:</strong> Astrophytum asterias\n<strong>Common Name:</strong> Sand Dollar Cactus, Sea Urchin Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Texas (USA) and Mexico\n<strong>Growth Habit:</strong> Small, flat, spineless cactus with round body and yellow flowers\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental, collectors’ cactus",
    "details": "Astrophytum asterias, known as Sand Dollar Cactus or Sea Urchin Cactus, is a small, flat, spineless cactus with a round body and yellow flowers. Thrives in full sun to partial shade, low water, and sandy well-draining soil. Ideal for ornamental and collectors’ cactus."
  },
  {
    "id": "PLANT116",
    "name": "Peruvian Crest",
    "botanical_name": "Cereus peruvianus f. cristata",
    "image_url": "assets/images/116.png",
    "description": "<strong>Botanical Name:</strong> Cereus peruvianus f. cristata\n<strong>Common Name:</strong> Peruvian Apple Cactus Crest, Crested Cereus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> South America (Brazil, Uruguay, Argentina)\n<strong>Growth Habit:</strong> Crested, fan-shaped cactus with unusual growth patterns\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Ornamental, unique collector’s cactus",
    "details": "Cereus peruvianus f. cristata, or Peruvian Crest, is a crested, fan-shaped cactus with unusual growth patterns. Requires full sun, low watering, and well-draining sandy soil. Ideal as an ornamental and for collectors."
  },
  {
    "id": "PLANT117",
    "name": "Hedgehog Cactus",
    "botanical_name": "Echinocereus sp.",
    "image_url": "assets/images/117.png",
    "description": "<strong>Botanical Name:</strong> Echinocereus sp.\n<strong>Common Name:</strong> Hedgehog Cactus\n<strong>Family:</strong> Cactaceae\n<strong>Origin:</strong> Southwestern USA, Mexico\n<strong>Growth Habit:</strong> Clumping, cylindrical cactus with bright flowers\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Rocky, sandy, well-draining\n<strong>Uses:</strong> Ornamental cactus, xeriscaping",
    "details": "Echinocereus sp., known as Hedgehog Cactus, is a clumping, cylindrical cactus with bright flowers. Prefers full sun, low watering, and rocky, sandy well-draining soil. Perfect for ornamental use and xeriscaping."
  },
  {
    "id": "PLANT118",
    "name": "Tanzanian Zipper Plant",
    "botanical_name": "Euphorbia anoplia",
    "image_url": "assets/images/118.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia anoplia\n<strong>Common Name:</strong> Tanzanian Zipper Plant\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Tanzania\n<strong>Growth Habit:</strong> Clumping, ribbed succulent stems with zipper-like ridges\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Ornamental succulent, pots, collectors’ plant",
    "details": "Euphorbia anoplia, or Tanzanian Zipper Plant, is a clumping succulent with ribbed stems featuring zipper-like ridges. Thrives in bright light to full sun, low watering, and well-draining sandy soil. Suitable for ornamental use, pots, and collectors."
  },
  {
    "id": "PLANT119",
    "name": "Fairy Washboard",
    "botanical_name": "Haworthia limifolia",
    "image_url": "assets/images/119.png",
    "description": "<strong>Botanical Name:</strong> Haworthia limifolia\n<strong>Common Name:</strong> Fairy Washboard\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Southern Africa (Mozambique, Eswatini, South Africa)\n<strong>Growth Habit:</strong> Rosette-forming succulent with rough, ridged dark green leaves\n<strong>Light Required:</strong> Bright indirect light; tolerates some sun\n<strong>Water Required:</strong> Low; allow soil to dry between waterings\n<strong>Soil Condition:</strong> Sandy, well-draining succulent mix\n<strong>Uses:</strong> Ornamental, indoor succulent",
    "details": "Haworthia limifolia, known as Fairy Washboard, is a rosette-forming succulent with rough, ridged dark green leaves. Prefers bright indirect light, low watering, and sandy well-draining soil. Ideal for indoor ornamental use."
  },
  {
    "id": "PLANT120",
    "name": "Blue Haworthia",
    "botanical_name": "Haworthia glauca",
    "image_url": "assets/images/120.png",
    "description": "<strong>Botanical Name:</strong> Haworthia glauca\n<strong>Common Name:</strong> Blue Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Upright rosettes with pointed, bluish-green leaves\n<strong>Light Required:</strong> Bright, indirect light\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Sandy, gritty, well-draining soil\n<strong>Uses:</strong> Potted succulent, ornamental",
    "details": "Haworthia glauca, or Blue Haworthia, features upright rosettes with pointed bluish-green leaves. Needs bright indirect light, low to moderate watering, and well-draining sandy soil. Great for potted succulents and ornamental purposes."
  },
  {
    "id": "PLANT121",
    "name": "Window Haworthia",
    "botanical_name": "Haworthia obtusa",
    "image_url": "assets/images/121.png",
    "description": "<strong>Botanical Name:</strong> Haworthia obtusa\n<strong>Common Name:</strong> Window Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Small rosettes with translucent, fleshy leaves forming clusters\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low to moderate; avoid overwatering\n<strong>Soil Condition:</strong> Well-draining, sandy succulent soil\n<strong>Uses:</strong> Indoor ornamental, terrariums, dish gardens",
    "details": "Haworthia obtusa, the Window Haworthia, forms small rosettes with translucent fleshy leaves. Prefers bright indirect light, low to moderate watering, and well-draining sandy soil. Perfect for indoor ornaments, terrariums, and dish gardens."
  },
  {
    "id": "PLANT122",
    "name": "Zebra Plant",
    "botanical_name": "Haworthia attenuata",
    "image_url": "assets/images/122.png",
    "description": "<strong>Botanical Name:</strong> Haworthia attenuata\n<strong>Common Name:</strong> Zebra Plant\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Rosette succulent with white tubercles (spots) forming stripes on leaves\n<strong>Light Required:</strong> Bright indirect light, tolerates partial shade\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining succulent mix\n<strong>Uses:</strong> Indoor ornamental, small pots",
    "details": "Haworthia attenuata, or Zebra Plant, is a rosette succulent with white striped tubercles. Needs bright indirect light, low watering, and well-draining soil. Ideal for indoor ornaments in small pots."
  },
  {
    "id": "PLANT123",
    "name": "Tessellated Haworthia",
    "botanical_name": "Haworthia venosa var. tessellata",
    "image_url": "assets/images/123.png",
    "description": "<strong>Botanical Name:</strong> Haworthia venosa var. tessellata\n<strong>Common Name:</strong> Tessellated Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Namibia, South Africa\n<strong>Growth Habit:</strong> Rosette succulent with translucent, window-like patterns on leaves\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Ornamental, indoor succulent",
    "details": "Haworthia venosa tessellata, the Tessellated Haworthia, forms rosettes with window-like leaf patterns. Requires bright indirect light, low watering, and sandy well-draining soil. Excellent for indoor ornamental use."
  },
  {
    "id": "PLANT124",
    "name": "Viscid Haworthia",
    "botanical_name": "Haworthia viscosa",
    "image_url": "assets/images/124.png",
    "description": "<strong>Botanical Name:</strong> Haworthia viscosa\n<strong>Common Name:</strong> Viscid Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Distinctive stacked triangular leaves forming columnar clusters\n<strong>Light Required:</strong> Bright indirect to filtered light\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental, collectors’ plant",
    "details": "Haworthia viscosa, or Viscid Haworthia, features stacked triangular leaves forming columnar clusters. Thrives in bright indirect to filtered light, low to moderate watering, and sandy well-draining soil. Suitable for ornamental and collector’s purposes."
  },
  {
    "id": "PLANT125",
    "name": "Wide Zebra Haworthia",
    "botanical_name": "Haworthia fasciata cv. ‘Wide Zebra’",
    "image_url": "assets/images/125.png",
    "description": "<strong>Botanical Name:</strong> Haworthia fasciata cv. ‘Wide Zebra’\n<strong>Common Name:</strong> Wide Zebra Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa (cultivar)\n<strong>Growth Habit:</strong> Rosette succulent with broad leaves marked with bold white stripes\n<strong>Light Required:</strong> Bright, indirect light\n<strong>Water Required:</strong> Low; drought-tolerant\n<strong>Soil Condition:</strong> Well-draining succulent mix\n<strong>Uses:</strong> Decorative potted succulent, indoor ornamental",
    "details": "Haworthia fasciata ‘Wide Zebra’ has broad rosette leaves with bold white stripes. Prefers bright indirect light, low watering, and well-draining succulent mix. Ideal for decorative pots and indoor ornamental displays."
  },
  {
    "id": "PLANT126",
    "name": "Green Zebra Plant",
    "botanical_name": "Haworthia attenuata cv. ‘Green’",
    "image_url": "assets/images/126.png",
    "description": "<strong>Botanical Name:</strong> Haworthia attenuata cv. ‘Green’\n<strong>Common Name:</strong> Green Zebra Plant\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa (cultivar)\n<strong>Growth Habit:</strong> Green-leaved form of attenuata with less pronounced white striping\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Indoor ornamental",
    "details": "Haworthia attenuata ‘Green’ is a green-leaved form of the Zebra Plant with subtle white striping. Prefers bright indirect light, low watering, and well-draining sandy soil. Ideal for indoor ornamental use."
  },
  {
    "id": "PLANT127",
    "name": "Cooper’s Haworthia",
    "botanical_name": "Haworthia cooperi",
    "image_url": "assets/images/127.png",
    "description": "<strong>Botanical Name:</strong> Haworthia cooperi\n<strong>Common Name:</strong> Cooper’s Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Small clumping rosettes with translucent leaf tips resembling glass\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Indoor pots, terrariums, collectors’ plant",
    "details": "Haworthia cooperi forms small clumping rosettes with translucent leaf tips that resemble glass. Needs bright indirect light, low to moderate watering, and well-draining sandy soil. Perfect for indoor pots, terrariums, and collectors."
  },
  {
    "id": "PLANT128",
    "name": "Zebra Plant",
    "botanical_name": "Haworthia attenuata",
    "image_url": "assets/images/128.png",
    "description": "<strong>Botanical Name:</strong> Haworthia attenuata\n<strong>Common Name:</strong> Zebra Plant\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Rosette succulent with white horizontal tubercles\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining succulent mix\n<strong>Uses:</strong> Indoor ornamental",
    "details": "Haworthia attenuata, the Zebra Plant, is a rosette succulent with white horizontal tubercles. Prefers bright indirect light, low watering, and well-draining succulent mix. Ideal for indoor ornamental use."
  },
  {
    "id": "PLANT129",
    "name": "Cathedral Window Haworthia",
    "botanical_name": "Haworthia cymbiformis",
    "image_url": "assets/images/129.png",
    "description": "<strong>Botanical Name:</strong> Haworthia cymbiformis\n<strong>Common Name:</strong> Cathedral Window Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Rosettes with boat-shaped, translucent green leaves\n<strong>Light Required:</strong> Bright indirect light, tolerates shade\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Ornamental, terrariums, indoor succulent",
    "details": "Haworthia cymbiformis, known as Cathedral Window Haworthia, forms rosettes with boat-shaped, translucent green leaves. Needs bright indirect light, low to moderate watering, and sandy well-draining soil. Suitable for terrariums and indoor ornamental use."
  },
  {
    "id": "PLANT130",
    "name": "Venosa Haworthia",
    "botanical_name": "Haworthia venosa",
    "image_url": "assets/images/130.png",
    "description": "<strong>Botanical Name:</strong> Haworthia venosa\n<strong>Common Name:</strong> Venosa Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Namibia, South Africa\n<strong>Growth Habit:</strong> Rosette succulent with thick fleshy leaves, sometimes with translucent windows\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Ornamental, collectors’ succulent",
    "details": "Haworthia venosa, or Venosa Haworthia, forms rosettes with thick fleshy leaves, occasionally featuring translucent windows. Prefers bright indirect light, low watering, and well-draining sandy soil. Ideal for ornamental and collector succulent use."
  },
  {
    "id": "PLANT131",
    "name": "Fairy Washboard",
    "botanical_name": "Haworthia limifolia",
    "image_url": "assets/images/131.png",
    "description": "<strong>Botanical Name:</strong> Haworthia limifolia\n<strong>Common Name:</strong> Fairy Washboard\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Southern Africa\n<strong>Growth Habit:</strong> Rosette succulent with ridged, dark green leaves\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low, drought-tolerant\n<strong>Soil Condition:</strong> Well-draining sandy mix\n<strong>Uses:</strong> Indoor ornamental, pots",
    "details": "Haworthia limifolia, known as Fairy Washboard, forms rosette succulents with ridged dark green leaves. Prefers bright indirect light, low watering, and well-draining sandy soil. Ideal for indoor pots."
  },
  {
    "id": "PLANT132",
    "name": "Planifolia Haworthia",
    "botanical_name": "Haworthia planifolia",
    "image_url": "assets/images/132.png",
    "description": "<strong>Botanical Name:</strong> Haworthia planifolia\n<strong>Common Name:</strong> Planifolia Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Rosette with smooth, flattened leaves\n<strong>Light Required:</strong> Bright, filtered light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Succulent collection, potted plant",
    "details": "Haworthia planifolia forms rosettes with smooth, flattened leaves. Requires bright filtered light, low watering, and sandy well-draining soil. Suitable for succulent collections and potted plants."
  },
  {
    "id": "PLANT133",
    "name": "Reinwardt’s Haworthia",
    "botanical_name": "Haworthia reinwardtii",
    "image_url": "assets/images/133.png",
    "description": "<strong>Botanical Name:</strong> Haworthia reinwardtii\n<strong>Common Name:</strong> Reinwardt’s Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Tall, columnar rosettes with white tubercles\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, gritty, well-draining\n<strong>Uses:</strong> Indoor ornamental, succulent gardens",
    "details": "Haworthia reinwardtii forms tall columnar rosettes with white tubercles. Prefers bright indirect light, low watering, and sandy, gritty, well-draining soil. Great for indoor ornamental use and succulent gardens."
  },
  {
    "id": "PLANT134",
    "name": "Mutica Haworthia",
    "botanical_name": "Haworthia mutica",
    "image_url": "assets/images/134.png",
    "description": "<strong>Botanical Name:</strong> Haworthia mutica\n<strong>Common Name:</strong> Mutica Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Compact rosette with blunt-tipped, translucent green leaves\n<strong>Light Required:</strong> Bright, indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining succulent soil\n<strong>Uses:</strong> Collectors’ plant, ornamental",
    "details": "Haworthia mutica forms compact rosettes with blunt-tipped, translucent green leaves. Needs bright indirect light, low watering, and well-draining succulent soil. Ideal for collectors and ornamental use."
  },
  {
    "id": "PLANT135",
    "name": "Aloehaworthia",
    "botanical_name": "Aloehaworthia hybrid",
    "image_url": "assets/images/135.png",
    "description": "<strong>Botanical Name:</strong> Aloehaworthia hybrid\n<strong>Common Name:</strong> Aloehaworthia (Aloe × Haworthia hybrid)\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Cultivar (hybrid origin)\n<strong>Growth Habit:</strong> Small rosettes combining aloe-like vigor with haworthia form\n<strong>Light Required:</strong> Bright, indirect to filtered light\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental hybrid succulent",
    "details": "Aloehaworthia is a hybrid succulent combining aloe vigor with Haworthia rosettes. Prefers bright indirect to filtered light, low to moderate watering, and sandy well-draining soil. Perfect as an ornamental hybrid succulent."
  },
  {
    "id": "PLANT136",
    "name": "Turgid Haworthia",
    "botanical_name": "Haworthia turgida",
    "image_url": "assets/images/136.png",
    "description": "<strong>Botanical Name:</strong> Haworthia turgida\n<strong>Common Name:</strong> Turgid Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Clumping rosettes with translucent, turgid leaves\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Succulent displays, collectors’ plant",
    "details": "Haworthia turgida forms clumping rosettes with translucent, turgid leaves. Prefers bright indirect light, low to moderate watering, and well-draining sandy soil. Ideal for succulent displays and collectors."
  },
  {
    "id": "PLANT137",
    "name": "Retuse Haworthia",
    "botanical_name": "Haworthia retusa",
    "image_url": "assets/images/137.png",
    "description": "<strong>Botanical Name:</strong> Haworthia retusa\n<strong>Common Name:</strong> Retuse Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Flattened rosettes with translucent windows at leaf tips\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Gritty, sandy, well-draining\n<strong>Uses:</strong> Indoor ornamental",
    "details": "Haworthia retusa forms flattened rosettes with translucent windows at the leaf tips. Needs bright indirect light, low watering, and gritty, well-draining soil. Perfect for indoor ornamental use."
  },
  {
    "id": "PLANT138",
    "name": "Truncate-leaf Haworthia hybrid",
    "botanical_name": "Haworthia truncata hybrid",
    "image_url": "assets/images/138.png",
    "description": "<strong>Botanical Name:</strong> Haworthia truncata hybrid\n<strong>Common Name:</strong> Truncate-leaf Haworthia hybrid\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> Cultivar/hybrid\n<strong>Growth Habit:</strong> Distinct rows of truncated leaves, often mixed forms in hybrids\n<strong>Light Required:</strong> Bright, indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Collector’s hybrid succulent",
    "details": "Haworthia truncata hybrid displays distinct rows of truncated leaves. Prefers bright indirect light, low watering, and sandy well-draining soil. Ideal for collectors of hybrid succulents."
  },
  {
    "id": "PLANT139",
    "name": "Turgid Haworthia",
    "botanical_name": "Haworthia turgida",
    "image_url": "assets/images/139.png",
    "description": "<strong>Botanical Name:</strong> Haworthia turgida\n<strong>Common Name:</strong> Turgid Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Clumping rosettes with translucent, turgid leaves\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Succulent displays, collectors’ plant",
    "details": "Haworthia turgida forms clumping rosettes with translucent, turgid leaves. Requires bright indirect light, low to moderate watering, and well-draining sandy soil. Suitable for succulent displays and collectors."
  },
  {
    "id": "PLANT140",
    "name": "Concolor Haworthia",
    "botanical_name": "Haworthia concolor",
    "image_url": "assets/images/140.png",
    "description": "<strong>Botanical Name:</strong> Haworthia concolor\n<strong>Common Name:</strong> Concolor Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Compact rosettes with dotted leaves, resembling zebra haworthia\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining succulent soil\n<strong>Uses:</strong> Indoor ornamental",
    "details": "Haworthia concolor forms compact rosettes with dotted leaves resembling zebra Haworthia. Prefers bright indirect light, low watering, and well-draining succulent soil. Perfect for indoor ornamental use."
  },
  {
    "id": "PLANT141",
    "name": "Horse’s Teeth Haworthia",
    "botanical_name": "Haworthia truncata",
    "image_url": "assets/images/141.png",
    "description": "<strong>Botanical Name:</strong> Haworthia truncata\n<strong>Common Name:</strong> Horse’s Teeth Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Distinct rectangular leaves arranged in rows\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Gritty, sandy, well-draining soil\n<strong>Uses:</strong> Collectors’ favorite succulent",
    "details": "Haworthia truncata has distinct rectangular leaves arranged in rows. Prefers bright indirect light, low watering, and gritty well-draining soil. Popular among succulent collectors."
  },
  {
    "id": "PLANT142",
    "name": "Green Haworthia",
    "botanical_name": "Haworthia sp. (green cultivar/variety)",
    "image_url": "assets/images/142.png",
    "description": "<strong>Botanical Name:</strong> Haworthia sp. (green cultivar/variety)\n<strong>Common Name:</strong> Green Haworthia\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Small green rosette succulent\n<strong>Light Required:</strong> Bright, indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Indoor ornamental",
    "details": "Green Haworthia is a small rosette succulent with bright green leaves. Needs bright indirect light, low watering, and sandy well-draining soil. Suitable for indoor decoration."
  },
  {
    "id": "PLANT143",
    "name": "Retuse Haworthia (variety)",
    "botanical_name": "Haworthia retusa var.",
    "image_url": "assets/images/143.png",
    "description": "<strong>Botanical Name:</strong> Haworthia retusa var.\n<strong>Common Name:</strong> Retuse Haworthia (variety)\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Flattened rosettes with translucent windows at leaf tips\n<strong>Light Required:</strong> Bright, indirect light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Collectors’ succulent",
    "details": "This variety of Haworthia retusa forms flattened rosettes with translucent leaf windows. Prefers bright indirect light, low watering, and well-draining sandy soil. Great for succulent collectors."
  },
  {
    "id": "PLANT144",
    "name": "Filiferum Graptopetalum",
    "botanical_name": "Graptopetalum filiforum",
    "image_url": "assets/images/144.png",
    "description": "<strong>Botanical Name:</strong> Graptopetalum filiforum\n<strong>Common Name:</strong> Filiferum Graptopetalum\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Mexico\n<strong>Growth Habit:</strong> Rosettes of narrow, pointed leaves\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate, drought-tolerant\n<strong>Soil Condition:</strong> Gritty, well-draining soil\n<strong>Uses:</strong> Rock gardens, ornamental pots",
    "details": "Graptopetalum filiforum forms rosettes of narrow pointed leaves. Thrives in bright light to full sun with moderate watering and gritty, well-draining soil. Ideal for rock gardens and ornamental pots."
  },
  {
    "id": "PLANT145",
    "name": "Pencil Cactus / Firestick Plant",
    "botanical_name": "Euphorbia tirucalli",
    "image_url": "assets/images/145.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia tirucalli\n<strong>Common Name:</strong> Pencil Cactus / Firestick Plant\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Africa, India\n<strong>Growth Habit:</strong> Shrubby succulent with pencil-like green stems\n<strong>Light Required:</strong> Full sun to bright light\n<strong>Water Required:</strong> Very low, drought-tolerant\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental landscape plant, xeriscaping",
    "details": "Euphorbia tirucalli is a shrubby succulent with pencil-like green stems. Needs full sun to bright light, very low watering, and sandy well-draining soil. Suitable for xeriscaping and ornamental landscapes."
  },
  {
    "id": "PLANT146",
    "name": "African Milk Tree (Green form)",
    "botanical_name": "Euphorbia trigona",
    "image_url": "assets/images/146.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia trigona\n<strong>Common Name:</strong> African Milk Tree (Green form)\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Central Africa\n<strong>Growth Habit:</strong> Tall, upright succulent with triangular green stems\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Indoor/outdoor ornamental",
    "details": "Euphorbia trigona (Green form) is a tall upright succulent with triangular stems. Prefers full sun to partial shade, low watering, and sandy well-draining soil. Suitable for indoor and outdoor decoration."
  },
  {
    "id": "PLANT147",
    "name": "Variegated African Milk Tree",
    "botanical_name": "Euphorbia trigona ‘Variegata’",
    "image_url": "assets/images/147.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia trigona ‘Variegata’\n<strong>Common Name:</strong> Variegated African Milk Tree\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Central Africa\n<strong>Growth Habit:</strong> Tall, upright stems with creamy white and green variegation\n<strong>Light Required:</strong> Bright indirect to filtered sun\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Decorative succulent, collectors’ plant",
    "details": "This variegated Euphorbia trigona has upright stems with creamy white and green patterns. Needs bright indirect light, low watering, and well-draining sandy soil. Perfect for collectors and decoration."
  },
  {
    "id": "PLANT148",
    "name": "Royal Red African Milk Tree",
    "botanical_name": "Euphorbia trigona ‘Rubra’",
    "image_url": "assets/images/148.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia trigona ‘Rubra’\n<strong>Common Name:</strong> Royal Red African Milk Tree\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Central Africa\n<strong>Growth Habit:</strong> Upright stems with reddish-purple tones\n<strong>Light Required:</strong> Full sun enhances red color\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Ornamental succulent",
    "details": "Euphorbia trigona ‘Rubra’ has upright reddish-purple stems. Full sun enhances its red color. Requires low watering and well-draining sandy soil. Ideal as an ornamental succulent."
  },
  {
    "id": "PLANT149",
    "name": "Devil’s Backbone / Zigzag Plant",
    "botanical_name": "Euphorbia tithymaloides",
    "image_url": "assets/images/149.png",
    "description": "<strong>Botanical Name:</strong> Euphorbia tithymaloides\n<strong>Common Name:</strong> Devil’s Backbone / Zigzag Plant\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Tropical America\n<strong>Growth Habit:</strong> Shrubby succulent with zig-zag stems and variegated leaves\n<strong>Light Required:</strong> Bright indirect light to full sun\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Well-draining soil\n<strong>Uses:</strong> Indoor and outdoor ornamental plant",
    "details": "Euphorbia tithymaloides is a shrubby succulent with zig-zag stems and variegated leaves. Thrives in bright indirect light to full sun, moderate watering, and well-draining soil. Suitable for indoor and outdoor use."
  },
  {
    "id": "PLANT150",
    "name": "Variegated Kalanchoe",
    "botanical_name": "Kalanchoe sp. variegated",
    "image_url": "assets/images/150.png",
    "description": "<strong>Botanical Name:</strong> Kalanchoe sp. variegated\n<strong>Common Name:</strong> Variegated Kalanchoe\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Madagascar (species vary)\n<strong>Growth Habit:</strong> Succulent with variegated leaves (green, cream, sometimes pink)\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Well-draining sandy mix\n<strong>Uses:</strong> Ornamental succulent, indoor/outdoor pots",
    "details": "Variegated Kalanchoe has green, cream, and sometimes pink leaves. Needs bright light to full sun, low to moderate watering, and well-draining sandy soil. Great for indoor or outdoor ornamental pots."
  },
  {
    "id": "PLANT151",
    "name": "Fang Kalanchoe",
    "botanical_name": "Kalanchoe beharensis ‘Fang’",
    "image_url": "assets/images/151.png",
    "description": "<strong>Botanical Name:</strong> Kalanchoe beharensis ‘Fang’\n<strong>Common Name:</strong> Fang Kalanchoe\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Shrub-like succulent, thick triangular leaves with felt-like texture and fang-like protuberances\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate, drought-tolerant\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental, potted plant",
    "details": "Kalanchoe beharensis ‘Fang’ is a shrub-like succulent with thick, triangular, felt-textured leaves featuring fang-like tips. Prefers bright light to full sun, moderate watering, and sandy, well-draining soil."
  },
  {
    "id": "PLANT152",
    "name": "Chocolate Soldier / Panda Plant",
    "botanical_name": "Kalanchoe tomentosa ‘Chocolate Soldier’",
    "image_url": "assets/images/152.png",
    "description": "<strong>Botanical Name:</strong> Kalanchoe tomentosa ‘Chocolate Soldier’\n<strong>Common Name:</strong> Chocolate Soldier / Panda Plant\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Small succulent with fuzzy brown-edged leaves\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Indoor ornamental",
    "details": "Kalanchoe tomentosa ‘Chocolate Soldier’ is a small, fuzzy succulent with brown-edged leaves. Prefers bright indirect light, low to moderate watering, and well-draining sandy soil."
  },
  {
    "id": "PLANT153",
    "name": "Mother of Thousands / Chandelier Plant",
    "botanical_name": "Kalanchoe delagoensis",
    "image_url": "assets/images/153.png",
    "description": "<strong>Botanical Name:</strong> Kalanchoe delagoensis\n<strong>Common Name:</strong> Mother of Thousands / Chandelier Plant\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Tall, upright stems with tubular spotted leaves producing plantlets\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining soil\n<strong>Uses:</strong> Ornamental succulent",
    "details": "Kalanchoe delagoensis features tall upright stems with tubular spotted leaves that produce plantlets. Needs full sun to partial shade, low watering, and sandy well-draining soil. Ideal ornamental succulent."
  },
  {
    "id": "PLANT154",
    "name": "Elephant Ear Kalanchoe",
    "botanical_name": "Kalanchoe beharensis ‘Elephant Ear’",
    "image_url": "assets/images/154.png",
    "description": "<strong>Botanical Name:</strong> Kalanchoe beharensis ‘Elephant Ear’\n<strong>Common Name:</strong> Elephant Ear Kalanchoe\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Large succulent shrub with broad velvety leaves resembling elephant ears\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Well-draining soil\n<strong>Uses:</strong> Decorative foliage plant",
    "details": "Kalanchoe beharensis ‘Elephant Ear’ is a large succulent shrub with broad velvety leaves. Prefers bright light to full sun, moderate watering, and well-draining soil. Great as a decorative foliage plant."
  },
  {
    "id": "PLANT155",
    "name": "Mother of Thousands",
    "botanical_name": "Kalanchoe laetivirens",
    "image_url": "assets/images/155.png",
    "description": "<strong>Botanical Name:</strong> Kalanchoe laetivirens\n<strong>Common Name:</strong> Mother of Thousands\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Upright succulent with green leaves producing plantlets along margins\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental, naturalized plant",
    "details": "Kalanchoe laetivirens is an upright succulent producing plantlets along leaf margins. Thrives in full sun to partial shade, low watering, and sandy, well-draining soil. Excellent for ornamental and naturalized planting."
  },
  {
    "id": "PLANT156",
    "name": "Copper Spoons",
    "botanical_name": "Kalanchoe orgyalis ‘Copper Spoons’",
    "image_url": "assets/images/156.png",
    "description": "<strong>Botanical Name:</strong> Kalanchoe orgyalis ‘Copper Spoons’\n<strong>Common Name:</strong> Copper Spoons\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Shrub-like succulent with spoon-shaped leaves, copper on top and gray underneath\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental foliage",
    "details": "Kalanchoe orgyalis ‘Copper Spoons’ is a shrub-like succulent with spoon-shaped leaves, copper-colored on top and gray underneath. Prefers full sun to partial shade, low watering, and sandy, well-draining soil."
  },
  {
    "id": "PLANT157",
    "name": "Paddle Plant / Flapjack",
    "botanical_name": "Kalanchoe luciae",
    "image_url": "assets/images/157.png",
    "description": "<strong>Botanical Name:</strong> Kalanchoe luciae\n<strong>Common Name:</strong> Paddle Plant / Flapjack\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Flat, rounded leaves forming rosettes, often turning red in sun\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Well-draining sandy mix\n<strong>Uses:</strong> Foliage ornamental",
    "details": "Kalanchoe luciae has flat, rounded leaves forming rosettes that often turn red in full sun. Requires full sun to partial shade, moderate watering, and well-draining sandy mix."
  },
  {
    "id": "PLANT158",
    "name": "Walking Kalanchoe",
    "botanical_name": "Kalanchoe synsepala",
    "image_url": "assets/images/158.png",
    "description": "<strong>Botanical Name:</strong> Kalanchoe synsepala\n<strong>Common Name:</strong> Walking Kalanchoe\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> Madagascar\n<strong>Growth Habit:</strong> Rosette succulent producing offsets at the end of long stolons\n<strong>Light Required:</strong> Bright indirect light to full sun\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Sandy, gritty, well-draining\n<strong>Uses:</strong> Decorative hanging succulent",
    "details": "Kalanchoe synsepala is a rosette-forming succulent producing offsets at the ends of long stolons. Thrives in bright indirect light to full sun, moderate watering, and sandy, well-draining soil."
  },
  {
    "id": "PLANT159",
    "name": "Variegated Monadenium",
    "botanical_name": "Monadenium stapelioides variegated",
    "image_url": "assets/images/159.png",
    "description": "<strong>Botanical Name:</strong> Monadenium stapelioides variegated\n<strong>Common Name:</strong> Variegated Monadenium\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Tropical Africa\n<strong>Growth Habit:</strong> Caudiciform succulent with variegated fleshy stems\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Well-draining soil\n<strong>Uses:</strong> Ornamental caudex plant",
    "details": "Monadenium stapelioides variegated is a caudiciform succulent with variegated fleshy stems. Prefers bright indirect light, low to moderate watering, and well-draining soil."
  },
  {
    "id": "PLANT160",
    "name": "Anacampseros",
    "botanical_name": "Anacampseros spp.",
    "image_url": "assets/images/160.png",
    "description": "<strong>Botanical Name:</strong> Anacampseros spp.\n<strong>Common Name:</strong> Anacampseros\n<strong>Family:</strong> Anacampserotaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Small rosettes of fleshy leaves, mat-forming\n<strong>Light Required:</strong> Bright sun to partial shade\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Succulent collections",
    "details": "Anacampseros forms small, mat-forming rosettes of fleshy leaves. Needs bright sun to partial shade, low watering, and sandy, well-draining soil. Ideal for succulent collections."
  },
  {
    "id": "PLANT161",
    "name": "Tiger’s Jaw",
    "botanical_name": "Faucaria tigrina",
    "image_url": "assets/images/161.png",
    "description": "<strong>Botanical Name:</strong> Faucaria tigrina\n<strong>Common Name:</strong> Tiger’s Jaw\n<strong>Family:</strong> Aizoaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Rosette succulent with triangular toothed leaves\n<strong>Light Required:</strong> Full sun to bright light\n<strong>Water Required:</strong> Low\n<strong>Soil Condition:</strong> Well-draining, sandy\n<strong>Uses:</strong> Ornamental succulent",
    "details": "Faucaria tigrina is a rosette succulent with triangular, toothed leaves. Prefers full sun to bright light, low watering, and well-draining sandy soil. Excellent as an ornamental succulent."
  },
  {
    "id": "PLANT162",
    "name": "Jade Plant / Money Plant",
    "botanical_name": "Crassula ovata",
    "image_url": "assets/images/162.png",
    "description": "<strong>Botanical Name:</strong> Crassula ovata\n<strong>Common Name:</strong> Jade Plant / Money Plant\n<strong>Family:</strong> Crassulaceae\n<strong>Origin:</strong> South Africa, Mozambique\n<strong>Growth Habit:</strong> Shrubby succulent with fleshy oval leaves\n<strong>Light Required:</strong> Full sun to partial shade\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental, symbolic indoor plant",
    "details": "Crassula ovata is a shrubby succulent with fleshy oval leaves, suitable for full sun to partial shade. Requires low to moderate watering and sandy, well-draining soil. Commonly used as an ornamental or symbolic indoor plant."
  },
  {
    "id": "PLANT163",
    "name": "Raven ZZ Plant",
    "botanical_name": "Zamioculcas zamiifolia ‘Raven’",
    "image_url": "assets/images/163.png",
    "description": "<strong>Botanical Name:</strong> Zamioculcas zamiifolia ‘Raven’\n<strong>Common Name:</strong> Raven ZZ Plant\n<strong>Family:</strong> Araceae\n<strong>Origin:</strong> East Africa\n<strong>Growth Habit:</strong> Upright, glossy dark purple-black leaves\n<strong>Light Required:</strong> Low to bright indirect light\n<strong>Water Required:</strong> Very low, drought-tolerant\n<strong>Soil Condition:</strong> Well-draining potting soil\n<strong>Uses:</strong> Indoor ornamental, air-purifying",
    "details": "Zamioculcas ‘Raven’ has upright, glossy dark purple-black leaves. Thrives in low to bright indirect light, very low watering, and well-draining potting soil. Ideal as an indoor ornamental and air-purifying plant."
  },
  {
    "id": "PLANT164",
    "name": "Zenzi ZZ Plant",
    "botanical_name": "Zamioculcas zamiifolia ‘Zenzi’",
    "image_url": "assets/images/164.png",
    "description": "<strong>Botanical Name:</strong> Zamioculcas zamiifolia ‘Zenzi’\n<strong>Common Name:</strong> Zenzi ZZ Plant\n<strong>Family:</strong> Araceae\n<strong>Origin:</strong> East Africa\n<strong>Growth Habit:</strong> Compact dwarf cultivar with curled leaves\n<strong>Light Required:</strong> Low to bright indirect light\n<strong>Water Required:</strong> Very low\n<strong>Soil Condition:</strong> Well-draining soil\n<strong>Uses:</strong> Indoor ornamental, small spaces",
    "details": "Zamioculcas ‘Zenzi’ is a compact dwarf ZZ plant with curled leaves, suitable for low to bright indirect light. Requires very low watering and well-draining soil, perfect for indoor ornamental use in small spaces."
  },
  {
    "id": "PLANT165",
    "name": "Variegated Devil’s Backbone",
    "botanical_name": "Pedilanthus tithymaloides variegated",
    "image_url": "assets/images/165.png",
    "description": "<strong>Botanical Name:</strong> Pedilanthus tithymaloides variegated\n<strong>Common Name:</strong> Variegated Devil’s Backbone\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Tropical America\n<strong>Growth Habit:</strong> Upright zig-zag stems with variegated leaves\n<strong>Light Required:</strong> Bright light to full sun\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Well-draining soil\n<strong>Uses:</strong> Ornamental, indoor/outdoor",
    "details": "Pedilanthus variegated has upright zig-zag stems with variegated leaves. Prefers bright light to full sun, moderate watering, and well-draining soil. Suitable as an ornamental indoor or outdoor plant."
  },
  {
    "id": "PLANT166",
    "name": "Twisted Devil’s Backbone",
    "botanical_name": "Pedilanthus tithymaloides (twisted form)",
    "image_url": "assets/images/166.png",
    "description": "<strong>Botanical Name:</strong> Pedilanthus tithymaloides (twisted form)\n<strong>Common Name:</strong> Twisted Devil’s Backbone\n<strong>Family:</strong> Euphorbiaceae\n<strong>Origin:</strong> Tropical America\n<strong>Growth Habit:</strong> Zig-zag succulent with twisted growth pattern\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Moderate\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental",
    "details": "Pedilanthus twisted form has zig-zag succulent stems with a twisted growth pattern. Thrives in bright indirect light, moderate watering, and sandy, well-draining soil. Perfect for ornamental displays."
  },
  {
    "id": "PLANT168",
    "name": "Dwarf Sansevieria Ballyi",
    "botanical_name": "Sansevieria ballyi",
    "image_url": "assets/images/168.png",
    "description": "<strong>Botanical Name:</strong> Sansevieria ballyi\n<strong>Common Name:</strong> Dwarf Sansevieria Ballyi\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Kenya, Tanzania\n<strong>Growth Habit:</strong> Small cylindrical leaves in rosettes\n<strong>Light Required:</strong> Low to bright indirect light\n<strong>Water Required:</strong> Very low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Miniature ornamental, indoor",
    "details": "Sansevieria ballyi is a miniature succulent with small cylindrical leaves forming rosettes. Thrives in low to bright indirect light, requires very low watering, and sandy, well-draining soil. Ideal as a small indoor ornamental plant."
  },
  {
    "id": "PLANT169",
    "name": "Boncel Sansevieria / Starfish Sansevieria",
    "botanical_name": "Sansevieria cylindrica ‘Boncel’",
    "image_url": "assets/images/169.png",
    "description": "<strong>Botanical Name:</strong> Sansevieria cylindrica ‘Boncel’\n<strong>Common Name:</strong> Boncel Sansevieria / Starfish Sansevieria\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Africa\n<strong>Growth Habit:</strong> Fan-shaped cylindrical succulent leaves\n<strong>Light Required:</strong> Low to bright indirect light\n<strong>Water Required:</strong> Very low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Indoor ornamental",
    "details": "Sansevieria ‘Boncel’ has fan-shaped cylindrical succulent leaves. Grows well in low to bright indirect light, requires very low watering, and sandy, well-draining soil. Perfect for indoor ornamental display."
  },
  {
    "id": "PLANT170",
    "name": "Shrubby Sansevieria",
    "botanical_name": "Sansevieria suffruticosa",
    "image_url": "assets/images/170.png",
    "description": "<strong>Botanical Name:</strong> Sansevieria suffruticosa\n<strong>Common Name:</strong> Shrubby Sansevieria\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> East Africa\n<strong>Growth Habit:</strong> Shrubby succulent with erect cylindrical leaves\n<strong>Light Required:</strong> Full sun to low light\n<strong>Water Required:</strong> Very low\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental, hardy houseplant",
    "details": "Sansevieria suffruticosa is a shrubby succulent with erect cylindrical leaves. Adaptable to full sun or low light, requires very low watering, and sandy, well-draining soil. Excellent as a hardy ornamental houseplant."
  },
  {
    "id": "PLANT171",
    "name": "Hybrid Snake Plant",
    "botanical_name": "Sansevieria hybrid",
    "image_url": "assets/images/171.png",
    "description": "<strong>Botanical Name:</strong> Sansevieria hybrid\n<strong>Common Name:</strong> Hybrid Snake Plant\n<strong>Family:</strong> Asparagaceae\n<strong>Origin:</strong> Cultivar/hybrid (horticultural)\n<strong>Growth Habit:</strong> Variable depending on cross, typically upright leaves\n<strong>Light Required:</strong> Low to bright indirect light\n<strong>Water Required:</strong> Very low\n<strong>Soil Condition:</strong> Well-draining sandy soil\n<strong>Uses:</strong> Indoor ornamental, air-purifying",
    "details": "Sansevieria hybrid is a versatile snake plant with upright leaves. Thrives in low to bright indirect light, requires very low watering, and well-draining sandy soil. Ideal as an indoor ornamental and air-purifying plant."
  },
  {
    "id": "PLANT172",
    "name": "Gasteria",
    "botanical_name": "Gasteria spp.",
    "image_url": "assets/images/172.png",
    "description": "<strong>Botanical Name:</strong> Gasteria spp.\n<strong>Common Name:</strong> Gasteria\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Rosette-forming succulent with thick, tongue-shaped leaves, often mottled\n<strong>Light Required:</strong> Bright indirect light to partial shade\n<strong>Water Required:</strong> Low to moderate\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Indoor ornamental, succulent collections",
    "details": "Gasteria is a rosette-forming succulent with thick, tongue-shaped mottled leaves. Prefers bright indirect light to partial shade, low to moderate watering, and sandy, well-draining soil. Perfect for indoor ornamental and succulent collections."
  },
  {
    "id": "PLANT173",
    "name": "Gasteria",
    "botanical_name": "Gasteria spp.",
    "image_url": "assets/images/173.png",
    "description": "<strong>Botanical Name:</strong> Gasteria spp.\n<strong>Common Name:</strong> Gasteria\n<strong>Family:</strong> Asphodelaceae\n<strong>Origin:</strong> South Africa\n<strong>Growth Habit:</strong> Small to medium rosettes, leathery leaves with spots or bands\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Moderate, drought-tolerant\n<strong>Soil Condition:</strong> Sandy, gritty soil\n<strong>Uses:</strong> Decorative indoor/outdoor",
    "details": "Gasteria forms small to medium rosettes with leathery spotted or banded leaves. Requires bright indirect light, moderate watering, and sandy, gritty soil. Suitable for decorative indoor or outdoor display."
  },
  {
    "id": "PLANT174",
    "name": "Earth Star",
    "botanical_name": "Cryptanthus spp.",
    "image_url": "assets/images/174.png",
    "description": "<strong>Botanical Name:</strong> Cryptanthus spp.\n<strong>Common Name:</strong> Earth Star\n<strong>Family:</strong> Bromeliaceae\n<strong>Origin:</strong> Brazil\n<strong>Growth Habit:</strong> Small rosette-forming bromeliads with flat star-shaped leaves, often variegated or patterned\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Moderate, keep soil lightly moist\n<strong>Soil Condition:</strong> Well-draining, organic-rich soil\n<strong>Uses:</strong> Indoor ornamental, terrariums",
    "details": "Cryptanthus, or Earth Star, is a small rosette-forming bromeliad with flat, star-shaped variegated leaves. Needs bright indirect light, moderate watering, and well-draining organic-rich soil. Ideal for indoor ornamental use and terrariums."
  },
  {
    "id": "PLANT175",
    "name": "Earth Star",
    "botanical_name": "Cryptanthus spp.",
    "image_url": "assets/images/175.png",
    "description": "<strong>Botanical Name:</strong> Cryptanthus spp.\n<strong>Common Name:</strong> Earth Star\n<strong>Family:</strong> Bromeliaceae\n<strong>Origin:</strong> Brazil\n<strong>Growth Habit:</strong> Ground-hugging bromeliad with colorful striped foliage\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Regular, keep soil slightly moist\n<strong>Soil Condition:</strong> Well-draining with organic matter\n<strong>Uses:</strong> Indoor decorative plant",
    "details": "Cryptanthus is a ground-hugging bromeliad with colorful striped foliage. Thrives in bright indirect light, requires regular watering with slightly moist soil, and prefers well-draining organic soil. Perfect as an indoor decorative plant."
  },
  {
    "id": "PLANT176",
    "name": "Earth Star",
    "botanical_name": "Cryptanthus spp.",
    "image_url": "assets/images/176.png",
    "description": "<strong>Botanical Name:</strong> Cryptanthus spp.\n<strong>Common Name:</strong> Earth Star\n<strong>Family:</strong> Bromeliaceae\n<strong>Origin:</strong> Brazil\n<strong>Growth Habit:</strong> Compact bromeliad, forming patterned rosettes\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Moderate, avoid soggy soil\n<strong>Soil Condition:</strong> Well-draining, airy potting mix\n<strong>Uses:</strong> Terrariums, houseplant",
    "details": "Compact Cryptanthus forms patterned rosettes. Prefers bright indirect light, moderate watering without soggy soil, and well-draining, airy potting mix. Ideal for terrariums and as a houseplant."
  },
  {
    "id": "PLANT177",
    "name": "Earth Star",
    "botanical_name": "Cryptanthus spp.",
    "image_url": "assets/images/177.png",
    "description": "<strong>Botanical Name:</strong> Cryptanthus spp.\n<strong>Common Name:</strong> Earth Star\n<strong>Family:</strong> Bromeliaceae\n<strong>Origin:</strong> Brazil\n<strong>Growth Habit:</strong> Small terrestrial bromeliad with wavy or banded leaves\n<strong>Light Required:</strong> Bright, filtered light\n<strong>Water Required:</strong> Moderate, prefers humidity\n<strong>Soil Condition:</strong> Light, well-draining mix\n<strong>Uses:</strong> Tabletop or indoor ornamental",
    "details": "Small terrestrial Cryptanthus with wavy or banded leaves. Needs bright filtered light, moderate watering, and light, well-draining soil. Suitable for tabletop or indoor ornamental use."
  },
  {
    "id": "PLANT178",
    "name": "Earth Star",
    "botanical_name": "Cryptanthus spp.",
    "image_url": "assets/images/178.png",
    "description": "<strong>Botanical Name:</strong> Cryptanthus spp.\n<strong>Common Name:</strong> Earth Star\n<strong>Family:</strong> Bromeliaceae\n<strong>Origin:</strong> Brazil\n<strong>Growth Habit:</strong> Star-shaped plant with striped foliage, terrestrial bromeliad\n<strong>Light Required:</strong> Bright indirect light\n<strong>Water Required:</strong> Consistent but moderate\n<strong>Soil Condition:</strong> Loose, well-draining soil\n<strong>Uses:</strong> Ornamental, terrariums",
    "details": "Star-shaped Cryptanthus with striped foliage. Prefers bright indirect light, consistent moderate watering, and loose, well-draining soil. Ideal for ornamental use and terrariums."
  },
  {
    "id": "PLANT179",
    "name": "Madagascar Palm",
    "botanical_name": "Pachypodium spp.",
    "image_url": "assets/images/179.png",
    "description": "<strong>Botanical Name:</strong> Pachypodium spp.\n<strong>Common Name:</strong> Madagascar Palm\n<strong>Family:</strong> Apocynaceae\n<strong>Origin:</strong> Madagascar, Africa\n<strong>Growth Habit:</strong> Thick, spiny trunk with narrow leaves on top\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Low, drought-tolerant\n<strong>Soil Condition:</strong> Sandy, well-draining\n<strong>Uses:</strong> Ornamental, landscape accent",
    "details": "Pachypodium with thick spiny trunk and narrow leaf crown. Thrives in full sun, low watering, and sandy, well-draining soil. Perfect as an ornamental or landscape accent."
  },
  {
    "id": "PLANT180",
    "name": "Pachypodium",
    "botanical_name": "Pachypodium spp.",
    "image_url": "assets/images/180.png",
    "description": "<strong>Botanical Name:</strong> Pachypodium spp.\n<strong>Common Name:</strong> Pachypodium\n<strong>Family:</strong> Apocynaceae\n<strong>Origin:</strong> Madagascar, Africa\n<strong>Growth Habit:</strong> Caudiciform succulent shrub/tree with spines and clustered leaves\n<strong>Light Required:</strong> Full sun\n<strong>Water Required:</strong> Very low\n<strong>Soil Condition:</strong> Well-draining, sandy\n<strong>Uses:</strong> Outdoor ornamental, drought garden",
    "details": "Caudiciform Pachypodium with spiny trunk and clustered leaves. Needs full sun, very low watering, and well-draining sandy soil. Ideal for outdoor ornamental and drought gardens."
  },
  {
    "id": "PLANT181",
    "name": "Pachypodium",
    "botanical_name": "Pachypodium spp.",
    "image_url": "assets/images/181.png",
    "description": "<strong>Botanical Name:</strong> Pachypodium spp.\n<strong>Common Name:</strong> Pachypodium\n<strong>Family:</strong> Apocynaceae\n<strong>Origin:</strong> Madagascar, Africa\n<strong>Growth Habit:</strong> Succulent shrub/tree, bottle-shaped caudex with spines\n<strong>Light Required:</strong> Bright sun\n<strong>Water Required:</strong> Low, drought-tolerant\n<strong>Soil Condition:</strong> Well-draining soil\n<strong>Uses:</strong> Ornamental, collectors’ plant",
    "details": "Succulent Pachypodium with bottle-shaped caudex and spines. Prefers bright sun, low watering, and well-draining soil. Suitable as ornamental and for collectors’ plant displays."
  }
]
